{"_id": "q82d4c6ec", "title": "", "text": "What was the sum of Fourth Quarter without those Fourth Quarter smaller than 0, in 2012? (in million)\n\nFourth Quarter, sum"}
{"_id": "q855a35a0", "title": "", "text": "In which section is Interest income smaller thanProvision for credit losses?\n\nInterest income, Provision for credit losses"}
{"_id": "q85384530", "title": "", "text": "If Total Forward Hedged Revenues develops with the same growing rate in 2019, what will it reach in 2020? (in million)\n\nTotal Forward Hedged Revenues, growing rate"}
{"_id": "q842c8af2", "title": "", "text": "what was the ratio of the purchase in december 2012 to the purchase in january 2013\n\npurchase ratio"}
{"_id": "q85451756", "title": "", "text": "what is the highest total amount of segment in 2015?\n\ntotal amount, segment"}
{"_id": "q85737826", "title": "", "text": "How many kinds of period is the value of Customer deposits more than the 50% of the total value of Customer deposits?\n\nCustomer deposits, total value"}
{"_id": "q827742c4", "title": "", "text": "How many Amount for Credit Card (a) exceed the average of Amount for Credit Card (a) in 2012?\n\nAmount for Credit Card"}
{"_id": "q81e448f2", "title": "", "text": "considering the years 2015-2016 , what was the decrease observed in the expense for severance and other benefits?\n\nexpense, severance, benefits"}
{"_id": "q82305cc4", "title": "", "text": "What's the total amount of active, iSharesETFs and Non-ETF index in 2016 in equity (in million)\n\nactive, iShares ETFs, Non-ETF index, equity"}
{"_id": "q81a100a6", "title": "", "text": "for the terrestar acquisition what will the final cash purchase price be in millions paid upon closing?\n\nTerrestar acquisition, cash purchase price"}
{"_id": "q847a1ac4", "title": "", "text": "what is the percent change of interest paid between 2016 and 2017?\n\ninterest paid"}
{"_id": "q82bb179c", "title": "", "text": "how many years did it take to close the pilgrim plant after after its last refueling?\n\nPilgrim Plant, refueling"}
{"_id": "q82787914", "title": "", "text": "The total amount of which section ranks first for Years Ended December 31, for Credit loss impairments? (in million)\n\nCredit loss impairments"}
{"_id": "q847c4394", "title": "", "text": "as of december 31 , 2015 , what was the maximum premium on the dp&l preferred stock?\n\nmaximum premium, DP&L preferred stock"}
{"_id": "q85306054", "title": "", "text": "what was the ratio of the share repurchase in 2014 to 2015\n\nshare repurchase"}
{"_id": "q81b147b8", "title": "", "text": "In what sections is Granted greater than 100 for Options For Shares?\n\nGranted, Options For Shares"}
{"_id": "q81a86062", "title": "", "text": "Which element makes up more than 20 % of the total for Carrying amount of Total in 2009?\n\nCarrying amount, Total"}
{"_id": "q852ed734", "title": "", "text": "what percent did the balance increase from the beginning of 2016 to the end of 2017?\n\nbalance increase"}
{"_id": "q81097aec", "title": "", "text": "containerboards net sales represented what percentage of industrial packaging sales in 2005?\n\ncontainerboards, net sales, industrial packaging sales"}
{"_id": "q8232eeda", "title": "", "text": "what percentage of total debt maturity occurred in 2018 and thereafter?\n\ntotal debt maturity"}
{"_id": "q82c368f2", "title": "", "text": "what was the total impairment relating to us assets?\n\ntotal impairment, US assets"}
{"_id": "q83dfd0c2", "title": "", "text": "What's the sum of Software and IT maintenance expenses of 2017, Customer deposits of Less Than 1 Year, and Client claims and refunds of 2016 ?\n\nSoftware and IT maintenance expenses, Customer deposits, Client claims and refunds"}
{"_id": "q84448792", "title": "", "text": "What is the sum of the Net investment income and Total revenue in the sections where Required interest on net reserves is positive?\n\nNet investment income, Total revenue, Required interest, net reserves"}
{"_id": "q8332f334", "title": "", "text": "What's the sum of Cost of sales of Year Ended December 31, 2016, Decreases in current period tax positions, and Total Year Ended December 31, 2005 of Balance at End of Period ?\n\nCost of sales, current period tax positions, Balance at End of Period"}
{"_id": "q83905290", "title": "", "text": "what is the percentage change in interest expense-net , from 2015 to 2016?\n\ninterest expense-net"}
{"_id": "q84a187b2", "title": "", "text": "What was the average value of the amount for Europe, the amount for Middle East and Africa , the amount for Asia-Pacific in 2017 ?\n\naverage value, Europe, Middle East and Africa, Asia-Pacific"}
{"_id": "q833c8228", "title": "", "text": "What's the total amount of Management and financial advice fees, Distribution fees, Net investment income and Premiums in 2013? (in million)\n\nManagement fees, financial advice fees, Distribution fees, Net investment income, Premiums"}
{"_id": "q85c8bb88", "title": "", "text": "In the year with lowest amount of Commercial for TotalLoans, what's the increasing rate of Equipment lease financing for TotalLoans?\n\nCommercial, Total Loans, Equipment lease financing"}
{"_id": "q8144794e", "title": "", "text": "In the year with lowest amount of Distribution fees, what's the increasing rate of Net investment income? (in %)\n\nDistribution fees, Net investment income"}
{"_id": "q84abfc2e", "title": "", "text": "What is the sum of the Notebooks/Mobile Devices in the years where Netcomm Products is greater than 1400? (in millions)\n\nNotebooks, Mobile Devices, Netcomm Products"}
{"_id": "q811aabe6", "title": "", "text": "What is the proportion of Asset Management to the total Mortgage and other loans receivable, net of allowance in 2006?\n\nAsset Management, Mortgage, loans receivable, allowance"}
{"_id": "q811d0d0a", "title": "", "text": "What is the growing rate of Net credit losses in the year with the most Provision for benefits and claims?\n\nNet credit losses, Provision for benefits and claims"}
{"_id": "q82364166", "title": "", "text": "In the year with largest amount of Product revenue, what's the sum of Product revenue and Service and other revenue ? (in million)\n\nProduct revenue, Service revenue, other revenue"}
{"_id": "q83c3dbba", "title": "", "text": "What will Long-term debt reach in 2010 if it continues to grow at its current rate?\n\nLong-term debt"}
{"_id": "q8258ff9e", "title": "", "text": "What is the sum of Home equity in 2011 and Operating lease obligations for Total? (in million)\n\nHome equity, Operating lease obligations, Total"}
{"_id": "q84360b04", "title": "", "text": "Which year is Granted for shares(in thousands) the most?\n\nGranted for shares"}
{"_id": "q8397ee9c", "title": "", "text": "Which year is Cash and cash equivalents the most?\n\nCash and cash equivalents"}
{"_id": "q818cb290", "title": "", "text": "What is the sum of Net written premiums in the range of 1 and 3000 in 2014? (in million)\n\nNet written premiums"}
{"_id": "q8203fe68", "title": "", "text": "what was the percentage change in share-based compensation expense between 2012 and 2013?\n\nshare-based compensation expense"}
{"_id": "q82f207b6", "title": "", "text": "Which element makes up more than 20% of the total equity securities for Level 1 of U.S. defined benefit pension plans in 2011?\n\ntotal equity securities, Level 1, U.S. defined benefit pension plans"}
{"_id": "q83e3e52c", "title": "", "text": "In terms of Assets,which year is Fair Values of Total derivatives designated as hedging instruments on December 31 smaller than 100000 thousand?\n\nFair Values, Total derivatives, hedging instruments"}
{"_id": "q82374f34", "title": "", "text": "What is the amount of Commercial and Commercial realestate in the years with the least Commercial for Gross Charge-offs ? (in million)\n\nCommercial, Commercial real estate, Gross Charge-offs"}
{"_id": "q83e16b08", "title": "", "text": "what was the sum of the shares purchase discount from 2015 to 2017 in millions\n\nshares purchase discount"}
{"_id": "q830208be", "title": "", "text": "What is the average value of Total operating revenues for Corporate Benefit Funding, Auto & Home, and International ? (in million)\n\nTotal operating revenues, Corporate Benefit Funding, Auto & Home, International"}
{"_id": "q83554574", "title": "", "text": "In the year with largest amount of SquareFeet of Total Consolidated Portfolio, what's the increasing rate of Ann. RentRevenue of Total Consolidated Portfolio?\n\nSquareFeet, Total Consolidated Portfolio, Ann. Rent Revenue"}
{"_id": "q848f1da2", "title": "", "text": "What was the average value of proceeds from sales of investments, proceeds from maturities of investments,proceeds from significant disposals in 2016 for Citigroup consolidated? (in million)\n\naverage value, proceeds from sales of investments, Citigroup"}
{"_id": "q84494d40", "title": "", "text": "What's the current increasing rate of GAAP of Operating Income?\n\nGAAP, Operating Income, increasing rate"}
{"_id": "q83562c00", "title": "", "text": "When does Net interest income reach the largest value?\n\nNet interest income"}
{"_id": "q81cfaef6", "title": "", "text": "What's the greatest value of Premiums earned for Twelve Months Ended December 31, 2015\n\nPremiums earned"}
{"_id": "q821eb91a", "title": "", "text": "considering the year 2006 , what is the percentual fluctuation of the return provided by s&p 500 and the one provided by old peer group?\n\npercentual fluctuation, return, S&P 500, old peer group"}
{"_id": "q83ee4b48", "title": "", "text": "What's the increasing rate of Total segment in 2016 for Total Incurred?\n\nTotal segment, Total Incurred, increasing rate"}
{"_id": "q8284743a", "title": "", "text": "What's the sum of elements in 2014? (in million)\n\nsum, elements"}
{"_id": "q823ddc1e", "title": "", "text": "percent change of average shares outstanding when taking dilution into consideration in 2008?\n\naverage shares outstanding, dilution"}
{"_id": "q8543ee4e", "title": "", "text": "Which year is Operating revenues for Electric the most?\n\nOperating revenues, Electric"}
{"_id": "q82d0e284", "title": "", "text": "As As the chart 4 shows,what do all Total revenues sum up, excluding the Total revenues for Retirement Products and the Total revenues for Corporate Benefit Funding? (in million)\n\nTotal revenues, Retirement Products, Corporate Benefit Funding"}
{"_id": "q820e4ada", "title": "", "text": "what is the average price of the increased electricity usage per gwh?\n\naverage price, increased electricity usage, GWh"}
{"_id": "q81661522", "title": "", "text": "In the year with the most Granted for shares(in thousands), what is the growth rate of Outstanding ? (in %)\n\nGranted for shares, Outstanding, growth rate"}
{"_id": "q81719e24", "title": "", "text": "What is the sum of Net credit losses in 2009 and Gains on sales of real estate and other in 2006? (in million)\n\nNet credit losses, Gains on sales of real estate"}
{"_id": "q83fd9170", "title": "", "text": "What is the sum of Case reserves of 2008 Ceded, and Balance, end of year of 2009 ?\n\nCase reserves, Ceded, Balance, end of year"}
{"_id": "q83baea32", "title": "", "text": "What is the percentage of all Cash and cash equivalents and Unsettled fund receivables that are positive to the total amount, in 2011 ?\n\nCash and cash equivalents, Unsettled fund receivables, total amount"}
{"_id": "q81d04c30", "title": "", "text": "What is the growing rate of Amplifiers/Radio frequency in table 0 in the year with the most Converters in table 0?\n\nAmplifiers, Radio Frequency, Converters"}
{"_id": "q84f2c618", "title": "", "text": "What is the sum of the Second Quarter 2012 in the sections where Six Months is positive? (in million)\n\nSecond Quarter, Six Months, sum"}
{"_id": "q83c04efa", "title": "", "text": "What was the average value of Tier 1 capital, Risk-weighted, Adjusted average for Basel III Standardized Transitional in 2016 ? (in million)\n\nTier 1 capital, Risk-weighted, Basel III Standardized Transitional"}
{"_id": "q83cf55b2", "title": "", "text": "Does the value of Future cash inflows for Total in 2003 greater than that in 2002 ?\n\nFuture cash inflows, Total"}
{"_id": "q82384b82", "title": "", "text": "What's the total value of all Value (In millions) that are in the range of 400 and 1000 in 2011? (in million)\n\ntotal value, range"}
{"_id": "q826ed10c", "title": "", "text": "What's the sum of all Shares that are positive in 2017?\n\nShares, positive"}
{"_id": "q8445e3ee", "title": "", "text": "What is the growing rate of Common equity tier 1 capital in the year with the most Standardized Approach?\n\nCommon equity tier 1 capital, Standardized Approach"}
{"_id": "q815dd65a", "title": "", "text": "In which year is Commercial Utilized Loans and leases positive?\n\nCommercial Utilized Loans, leases, positive"}
{"_id": "q817a53d4", "title": "", "text": "In the year with largest amount of Office Net Charge-offs in table 3, what's the increasing rate of Office Net Charge-offs in table 3?\n\nOffice Net Charge-offs, increasing rate"}
{"_id": "q8302f030", "title": "", "text": "What's the growth rate of Segment net sales in 2012?\n\ngrowth rate, Segment net sales"}
{"_id": "q83ecfa72", "title": "", "text": "For the section where the BALANCE, JANUARY 1, 2007 is negative, what's the value of the BALANCE, DECEMBER 31, 2007 ? (in million)\n\nBALANCE, negative, value"}
{"_id": "q83542c84", "title": "", "text": "What's the total amount of Town Grove, LLC, Avalon Del Rey, LLC, CVP I, LLC and Town Run Associates in 2007?\n\nTown Grove, LLC, Avalon Del Rey, LLC, CVP I, LLC, Town Run Associates"}
{"_id": "q839b24cc", "title": "", "text": "If Goodwill and other intangible assets, net develops with the same growth rate in 2017, what will it reach in 2018? (in million)\n\nGoodwill, intangible assets"}
{"_id": "q83880a04", "title": "", "text": "what was the total research and development from december 312017 to 2015 in millions\n\ntotal research and development"}
{"_id": "q82573bfa", "title": "", "text": "Does Case reserves inCeded keeps increasing each year between 2008 and 2009?\n\nCase reserves, ceded"}
{"_id": "q83206f84", "title": "", "text": "If Total assets for Assumed develops with the same growth rate in 2014, what will it reach in 2015? (in million)\n\nTotal assets, Assumed, growth rate"}
{"_id": "q84fb6e6c", "title": "", "text": "What was the total amount of the Total commercial lending in the years where Total commercial lending greater than 0? (in million)\n\nTotal commercial lending"}
{"_id": "q826da55c", "title": "", "text": "In the year with larger amount for Europe, what's the increasing rate of the amount for Asia-Pacific ?\n\nEurope, increasing rate, Asia-Pacific"}
{"_id": "q853b5e6e", "title": "", "text": "What's the growing rate of Total Forward Hedged Revenues in 2019?\n\nTotal Forward Hedged Revenues, growing rate"}
{"_id": "q82dca556", "title": "", "text": "what is the growth rate in net revenue for entergy wholesale commodities in 2013?\n\ngrowth rate, net revenue, Entergy Wholesale Commodities"}
{"_id": "q84e55370", "title": "", "text": "What's the increasing rate of Total operating revenues in 2011?\n\nTotal operating revenues"}
{"_id": "q8198bd92", "title": "", "text": "What's the growth rate of Net income of the Fourth Quarter in 2016?\n\ngrowth rate, Net income, Fourth Quarter"}
{"_id": "q8518ff4a", "title": "", "text": "what was the total refined products trunk lines production in tbd for the three year period?\n\nrefined products trunk lines production"}
{"_id": "q82be72ac", "title": "", "text": "What is the sum of Capital lease obligations for payments due by period ? (in thousand)\n\nCapital lease obligations, payments due"}
{"_id": "q85724ac8", "title": "", "text": "What was the total amount of the Global equity and equity-related in the years where Global long-term debt greater than 7 for Market Share ?\n\nGlobal equity, equity-related, long-term debt, Market Share"}
{"_id": "q8556c10e", "title": "", "text": "what was the percentage change in fuel surcharge program freight revenue from 2013 to 2014?\n\nfuel surcharge program, freight revenue"}
{"_id": "q82581dc2", "title": "", "text": "What is the average amount of 2019 Notes of 2013, and Granted of Number of shares ?\n\naverage amount, Notes, Granted, number of shares"}
{"_id": "q81bc4a1e", "title": "", "text": "What do all Benefits earned during the year sum up, excluding those negative ones in 2010 for Pension plans ? (in million)\n\nBenefits, Pension plans"}
{"_id": "q81520e92", "title": "", "text": "Is the total amount of all elements in 2014 greater than that in 2013 for CHANGE IN PROJECTED BENEFIT OBLIGATION for Con Edison?\n\nCHANGE IN PROJECTED BENEFIT OBLIGATION, Con Edison"}
{"_id": "q858b5c20", "title": "", "text": "In the year with largest amount of Net investment income in table 1, what's the sum of revenues in table 1? (in millions)\n\nNet investment income, sum of revenues"}
{"_id": "q81cb3060", "title": "", "text": "When does Projected benefit obligation at beginning of year f Con Edison reach the largest value?\n\nProjected benefit obligation, Con Edison"}
{"_id": "q84dd9f7c", "title": "", "text": "What is the average amount of Reserve for unearned premiums of 2014 As Reported, and Expired of Weighted Average Exercise Price ?\n\nReserve for unearned premiums, Weighted Average Exercise Price"}
{"_id": "q84e682ea", "title": "", "text": "What will adjusted total assets be like in 2018 if it develops with the same increasing rate as current? (in dollars in millions)\n\nadjusted total assets, increasing rate"}
{"_id": "q81566442", "title": "", "text": "What was the total amount of Expenses in 2008 for Amount? (in thousand)\n\ntotal amount, Expenses"}
{"_id": "q838b6d0c", "title": "", "text": "at december 31 , 2015 , what percent of the environmental-related reserves related to environmental-related asset retirement obligations ?\n\nenvironmental-related reserves, environmental-related asset retirement obligations"}
{"_id": "q834fefca", "title": "", "text": "In the year with largest amount of Regulated natural gas, what's the increasing rate of Nonregulated electric and other?\n\nRegulated natural gas, Nonregulated electric, increasing rate"}
{"_id": "q842fefc6", "title": "", "text": "Does Planned generation (TWh) keeps increasing each year between 2005 and 2006?\n\nPlanned generation"}
{"_id": "q8300ab0e", "title": "", "text": "Which level is U.S. Treasuries of Fixed Income Securities the highest?\n\nU.S. Treasuries, Fixed Income Securities"}
{"_id": "q81392cb0", "title": "", "text": "What's the sum of the Net investment income in the years where Other income is positive? (in million)\n\nNet investment income, Other income"}
{"_id": "q853e847c", "title": "", "text": "What is the average value of Total net revenue for Reported Results, Fully taxable-equivalent adjustment, and Managed basis ? (in million)\n\nTotal net revenue, Fully taxable-equivalent adjustment, Managed basis"}
{"_id": "q859daefc", "title": "", "text": "Which year is Estimated Fair Value in terms of Other the most?\n\nEstimated Fair Value, Other"}
{"_id": "q836cd57c", "title": "", "text": "In which section the sum of segment in 2015 has the highest value?\n\nsum of segment"}
{"_id": "q810fb0f6", "title": "", "text": "What was the total amount of Allowance greater than 270 in 2018? (in million)\n\nAllowance"}
{"_id": "q82b28b22", "title": "", "text": "In the year with lowest amount of Sales Commissions, what's the increasing rate of Occupancy and Equipment?\n\nSales Commissions, Occupancy, Equipment"}
{"_id": "q8384b3ea", "title": "", "text": "What's the sum of Group retirement products of Net Investment Income, Cash at end of year of 2011, and Cash at end of year of 2010 ?\n\nGroup retirement products, Net Investment Income, Cash at end of year"}
{"_id": "q81d7599e", "title": "", "text": "What's the average of US SBU in 2014, 2013, and 2012? (in million)\n\naverage, US SBU"}
{"_id": "q853c2a92", "title": "", "text": "What is the sum of Income (loss) before income taxes and minority interest of As Reported in 2006 and Sales in 2003? (in million)\n\nIncome (loss) before income taxes, minority interest, Sales"}
{"_id": "q81d3a056", "title": "", "text": "If Americas develops with the same growth rate in 2004, what will it reach in 2005? (in million)\n\nAmericas, growth rate"}
{"_id": "q849d08a4", "title": "", "text": "What will Premiums reach in 2012 if it continues to grow at its current rate? (in million)\n\nPremiums"}
{"_id": "q811c3614", "title": "", "text": "what was the percentage change in the allowance for loan losses from 2008 to 2009?\n\nallowance for loan losses"}
{"_id": "q82c9a85c", "title": "", "text": "by how much did the fair value of stock-based performance units outstanding decrease from 2016 to 2018?\n\nfair value, stock-based performance units, decrease"}
{"_id": "q83bc7cbc", "title": "", "text": "How much of March 31, 2008 is there in total without Operating revenues and Operating income? (in Thousand)\n\ntotal, Operating revenues, Operating income"}
{"_id": "q8175db10", "title": "", "text": "what is the percent change in average cds that were excluded between 2013 and 2014?\n\npercent change, average CDS, excluded"}
{"_id": "q82c2627c", "title": "", "text": "What's the total amount of Subtotal analog signal processing without those Subtotal analog signal processing smaller than 500000, in 2014?\n\nSubtotal analog signal processing"}
{"_id": "q82efcc80", "title": "", "text": "What is the average amount of Reinsurance assets of 2018 As Reported, and Cash provided by operating activities of 2014 ?\n\nReinsurance assets, Cash provided by operating activities"}
{"_id": "q82864972", "title": "", "text": "When does Total calendar year effect reach the largest value?\n\nTotal calendar year effect"}
{"_id": "q82b4cc20", "title": "", "text": "what is the percentage change in rent expenses for operating leases in 2010 compare to 2009?\n\nrent expenses, operating leases"}
{"_id": "q84ceb836", "title": "", "text": "Which year is Other borrowings the highest in terms of Carrying Value?\n\nOther borrowings, Carrying Value"}
{"_id": "q82871b7c", "title": "", "text": "what was the percentage change in the free cash flow from 2014 to 2015\n\nfree cash flow"}
{"_id": "q847a93dc", "title": "", "text": "How much of profit before taxes is there in total (in 2017) without U.S. tax reform impact and Gain on sale of equity investment? (in million)\n\nprofit before taxes, U.S. tax reform impact, Gain on sale of equity investment"}
{"_id": "q83e70dd8", "title": "", "text": "How many Share repurchase program exceed the average of Share repurchase program in October, 2013?\n\nShare repurchase program, average"}
{"_id": "q856d40e6", "title": "", "text": "In which section the sum ofProduct revenues, net has the highest value?\n\nProduct revenues, net"}
{"_id": "q81da9686", "title": "", "text": "In the section with lowest amount of Sales, what's the increasing rate of Fair Value ? (in %)\n\nSales, Fair Value, increasing rate"}
{"_id": "q81f778aa", "title": "", "text": "what are the total current assets of metropolitan?\n\ntotal current assets, Metropolitan"}
{"_id": "q82e4317c", "title": "", "text": "Which year is Standardized measure of discounted future net cash flows relating to proved oil and gas reserves(a) for Total the most?\n\nStandardized measure, discounted future net cash flows, proved oil and gas reserves, Total"}
{"_id": "q845eabea", "title": "", "text": "If Fixed income of Active develops with the same increasing rate in2016, what will it reach in 2017? (in million)\n\nFixed Income, Active, increasing rate"}
{"_id": "q836b9360", "title": "", "text": "In the year with largest amount of Granted of Shares in Table 3, what's the increasing rate of Net reserves in Table 4?\n\nGranted Shares, increasing rate, Net reserves"}
{"_id": "q815893ca", "title": "", "text": "what was the percentage change in the the fair value of our foreign currency forward contracts from 2008 to 2009\n\nfair value, foreign currency forward contracts"}
{"_id": "q8290c910", "title": "", "text": "What is the ratio of all value that are in the range of 400 and 1000 to the sum of value, in 2011?\n\nratio, value, sum"}
{"_id": "q8435886e", "title": "", "text": "% ( % ) change of the dilutive effect from 2006-2008\n\ndilutive effect"}
{"_id": "q837b54d0", "title": "", "text": "What is the total amount of Net sales of 2014, and Notes Payable of 2008 Carrying Amounts ?\n\nNet sales, Notes Payable, Carrying Amounts"}
{"_id": "q8580ff64", "title": "", "text": "Which year is Service cost for Pension Benefits the lowest?\n\nService cost, Pension Benefits"}
{"_id": "q81dc665a", "title": "", "text": "If China develops with the same growth rate in 2013, what will it reach in 2014? (in million)\n\nChina, growth rate"}
{"_id": "q83d4ede2", "title": "", "text": "In the year with largest amount of Fair Value for Aaa, what's the growing rate of Fair Value for Aa?\n\nFair Value, Aaa, growing rate, Aa"}
{"_id": "q83e4d1ee", "title": "", "text": "What will Balance of Derivatives be like in 2009 if it develops with the same increasing rate as current? (in dollars in millions)\n\nBalance of Derivatives, increasing rate"}
{"_id": "q8159e19e", "title": "", "text": "Which year is Residential mortgage for Recoveries of loans and leases previously charged off the most?\n\nResidential mortgage, Recoveries, loans, leases"}
{"_id": "q821d9148", "title": "", "text": "In which section is Alpine Country smaller than Alpine Village ?\n\nAlpine Country, Alpine Village"}
{"_id": "q8247de8a", "title": "", "text": "Which year is the amount of Benefit obligation at year end for Pension Benefits larger?\n\nBenefit obligation, Pension Benefits"}
{"_id": "q852a4c64", "title": "", "text": "What was the average value of the Fixed maturities: Foreign government bonds for AmortizedCost or Cost in the years where Corporate securities is positive for AmortizedCost or Cost? (in million)\n\naverage value, Fixed maturities, Foreign government bonds, Corporate securities"}
{"_id": "q84e8101a", "title": "", "text": "What's the growth rate of ABO less fair value of plan assets of Pension Benefits in 2015?\n\ngrowth rate, ABO, Pension Benefits"}
{"_id": "q81344b3c", "title": "", "text": "what's the total amount of Loss expenses Casualty of 2008 Gross, and Case reserves of 2009 Gross ?\n\nLoss expenses, Casualty, Case reserves"}
{"_id": "q85cc7e58", "title": "", "text": "In the year with lowest amount of Interruptible sales in thousands of Dt Delivered, what's the increasing rate of Total firm sales and transportation? (in %)\n\nInterruptible sales, Total firm sales, transportation"}
{"_id": "q84e182f4", "title": "", "text": "what is the roi of an investment in loews common stock from 2011 to 2012?\n\nroi, investment, Loews Common Stock"}
{"_id": "q83cdbf9a", "title": "", "text": "What is the ratio of Construction to the total in2015 for Commercial real estate?\n\nConstruction, Commercial real estate"}
{"_id": "q83caeaea", "title": "", "text": "what is the percentage change in common shareholders 2019 equity due to the adjustments presented in the table to reach basel iii cet1?\n\ncommon shareholders equity, Basel III, CET1"}
{"_id": "q843df09e", "title": "", "text": "What is the sum of the Price/mix-1 in the sections where Volume – Units is positive?\n\nPrice/mix-1, Volume – Units"}
{"_id": "q81db3f50", "title": "", "text": "What's the total amount of the Gas utility operations in the years where lectric utility operations is greater than 1?\n\nGas utility operations, electric utility operations"}
{"_id": "q82c4fd2a", "title": "", "text": "Does the value of Fixed income markets in 2004 greater than that in 2003?\n\nFixed income markets"}
{"_id": "q828a58aa", "title": "", "text": "If Total segment develops with the same increasing rate in 2016 for Total Incurred, what will it reach in 2017 for Total Incurred? (in million)\n\nTotal segment, Total Incurred"}
{"_id": "q837a4e78", "title": "", "text": "What's the average of the Private equity/venture capital in the years where SVB Capital Partners II, LP for Carrying value(as reported) for December 31, is positive? (in thousand)\n\nPrivate equity, venture capital, carrying value, SVB Capital Partners II, LP"}
{"_id": "q8441a2de", "title": "", "text": "What do all Change, net of taxes sum up, excluding those negative ones in 2015? (in million)\n\nChange, net of taxes"}
{"_id": "q84d56a96", "title": "", "text": "What is the sum of Cash and cash equivalents and marketable securities, Inventories and Total assets in 2014? (in million)\n\nCash and cash equivalents, marketable securities, Inventories, Total assets"}
{"_id": "q85b3b076", "title": "", "text": "What is the sum of the Tier 1 capital in the years where CET1 capital greater for Basel III Standardized Transitional is greater than 18300? (in million)\n\nTier 1 capital, CET1 capital, Basel III Standardized Transitional"}
{"_id": "q817f6202", "title": "", "text": "Which year is Total calendar year effect the most?\n\nTotal calendar year effect"}
{"_id": "q83c7a90c", "title": "", "text": "In the year with lowest amount of TRICARE subtotal, what's the increasing rate of Commercial and other?\n\nTRICARE, increasing rate, Commercial"}
{"_id": "q8241c7b6", "title": "", "text": "What is the percentage of all Qualifying Accounting Hedges-2 that are positive to the total amount, in 2010 for Gross Derivative Assets?\n\nQualifying Accounting Hedges-2, Gross Derivative Assets"}
{"_id": "q81b8fb70", "title": "", "text": "What is the sum of Commercial paper of 2011 Amortized Cost, Net sales of 2011, and Net sales of 2013 ?\n\nCommercial paper, Amortized Cost, Net sales"}
{"_id": "q8542325c", "title": "", "text": "In which year is Net earnings in As Reported positive?\n\nNet earnings, As Reported"}
{"_id": "q835b5ee6", "title": "", "text": "What will Interest cost on benefit obligation in U.S. pension plans be like in 2017 if it develops with the same increasing rate as current? (in million)\n\nInterest cost, benefit obligation, U.S. pension plans"}
{"_id": "q81439f7e", "title": "", "text": "What will Professional services be like in 2012 if it develops with the same increasing rate as current?\n\nProfessional services"}
{"_id": "q838d6486", "title": "", "text": "How much of Home equity is there in total without California and New York?\n\nHome equity, California, New York"}
{"_id": "q834d2524", "title": "", "text": "what percentage of the aggregate consideration for the greenline acquisition was paid to the sellers in 2009 based on the 2008 earn-out target?\n\naggregate consideration, Greenline acquisition, sellers, earn-out target"}
{"_id": "q8277c280", "title": "", "text": "In the years with lowest amount of Operating lease obligations in table 1, what's the increasing rate of Pension and other postretirement cash requirements in table 1?\n\nOperating lease obligations, Pension, postretirement cash requirements"}
{"_id": "q828e37cc", "title": "", "text": "by what percentage did protect carrying values of excess inventories increase from 2002 to 2003?\n\nprotect carrying values, excess inventories"}
{"_id": "q832dd8e0", "title": "", "text": "In the year with largest amount of Pension plans, what's the increasing rate of Benefits earned during the year?\n\nPension plans, Benefits earned"}
{"_id": "q83576886", "title": "", "text": "what is the highest total amount of Other? (in million)\n\ntotal amount, Other"}
{"_id": "q85a20326", "title": "", "text": "what is the percentage increase in total stock-based compensation expense from 2009 to 2010?\n\ntotal stock-based compensation expense"}
{"_id": "q83affb90", "title": "", "text": "What is the average amount of Investment banking fees of 2004, and Commissions and fees of Year Ended December 2014 ?\n\nInvestment banking fees, Commissions and fees"}
{"_id": "q848cf432", "title": "", "text": "in december 2016 the nclc issued senior unsecured notes due december 2021 , what is the payment they will receive on december 2021?\n\nNCLC, senior unsecured notes, payment"}
{"_id": "q8187d4c8", "title": "", "text": "In the year with largest amount of Management and financial advice fees, what's the sum of Distribution fees and Net investment income? (in million)\n\nManagement and financial advice fees, Distribution fees, Net investment income"}
{"_id": "q837f5ea4", "title": "", "text": "What is the total amount of Insurance of At December 31, 2017 Case Reserves, and Insurance of At December 31, 2016 Case Reserves ?\n\nInsurance, Case Reserves"}
{"_id": "q82852614", "title": "", "text": "What's the total value of all amount that are smaller than 100 in 2008? (in million)\n\ntotal value, amount"}
{"_id": "q82bca3be", "title": "", "text": "What's the difference of New orders between 2013 and 2012? (in million)\n\nNew orders"}
{"_id": "q8327a402", "title": "", "text": "What will Total assets reach in 2014 if it continues to grow at its current rate?\n\nTotal assets"}
{"_id": "q84404592", "title": "", "text": "What is the sum of Passive for Equities, Active and other, and Company stock/ESOP in 2008? (in billion)\n\nPassive for Equities, Active, Company stock/ESOP"}
{"_id": "q83b66782", "title": "", "text": "In the year with the most Net flows, what is the growth rate of Market appreciation/(depreciation)?\n\nNet flows, growth rate, market appreciation, market depreciation"}
{"_id": "q851ab862", "title": "", "text": "If Group specialty develops with the same growth rate in 2011, what will it reach in 2012? (in million)\n\nGroup specialty, growth rate"}
{"_id": "q8376846e", "title": "", "text": "What's the average of distribution fees and other revenues in 2014? (in million)\n\ndistribution fees, other revenues"}
{"_id": "q836db4e2", "title": "", "text": "What is the growing rate of Average expected option life (years) in the year with the most Risk-free interest rate (%)?\n\nAverage expected option life, Risk-free interest rate"}
{"_id": "q81e74066", "title": "", "text": "The total amount of which section ranks first inFirstQuarter ?\n\ntotal amount, section, First Quarter"}
{"_id": "q82b17a0c", "title": "", "text": "What is the total value of Pension and employee benefit obligations ,AFDC recorded in plant(a) ,Conservation programs(a) and Contract valuation adjustments(d) in 2006? (in thousand)\n\nPension and employee benefit obligations, AFDC, Conservation programs, Contract valuation adjustments"}
{"_id": "q85a157e6", "title": "", "text": "What is the sum of the revenues in the years where Net investment gains (losses) is positive? (in million)\n\nsum, revenues, Net investment gains, positive"}
{"_id": "q8319c9cc", "title": "", "text": "what will be the percentage increase in rent expense from 2013 to 2014?\n\nrent expense"}
{"_id": "q84d7866e", "title": "", "text": "what is the implied value of nigen based on the 2000 acquisition?\n\nimplied value, Nigen, acquisition"}
{"_id": "q849f8d68", "title": "", "text": "what is percentage change in rd&e spendings from 2013 to 2014?\n\npercentage change, R&D expenditures"}
{"_id": "q82afa40c", "title": "", "text": "In the year with lowest amount of Working capital, what's the increasing rate of Total assets?\n\nWorking capital, total assets, increasing rate"}
{"_id": "q83dc33e0", "title": "", "text": "What's the average of Bermuda of At December 31, 2017 IBNR Reserves, and Bermuda of At December 31, 2016 IBNR Reserves ?\n\nBermuda, IBNR Reserves"}
{"_id": "q80f34920", "title": "", "text": "How many Below Investment Grade exceed the average of Below Investment Grade in 2004?\n\nBelow Investment Grade, average"}
{"_id": "q85ce788e", "title": "", "text": "How many kinds of Writedowns are smaller than 0 in 2008 for Fixed Maturity Securities?\n\nWritedowns, Fixed Maturity Securities"}
{"_id": "q8160538a", "title": "", "text": "What is the sum of Unrecognized net loss CHANGE IN PLAN ASSETS of CECONY 2015, Operating earnings of 2008, and FUNDED STATUS CHANGE IN PLAN ASSETS of Con Edison 2014 ?\n\nUnrecognized net loss, CHANGE IN PLAN ASSETS, CECONY, Con Edison"}
{"_id": "q83b9f24e", "title": "", "text": "for the ipl cumulative preferred stock , what was the dividend rate at december 31 , 2016 and 2015?\n\nIPL, cumulative preferred stock, dividend rate"}
{"_id": "q8239f9dc", "title": "", "text": "What was the average value of the Total commercial in the years where Total commercial real estateis positive?\n\naverage value, Total commercial, Total commercial real estate"}
{"_id": "q82da7740", "title": "", "text": "Which section is Net interest income the lowest in 2016?\n\nNet interest income"}
{"_id": "q85924a12", "title": "", "text": "how much in combined repurchase claims , in millions , were recorded in the first quarter of 2005 , 2006 , 2007 , 2008?\n\ncombined repurchase claims"}
{"_id": "q855bb718", "title": "", "text": "what is the percentage change in aggregate notional amount of outstanding interest rate swaps from 2011 to 2012?\n\naggregate notional amount, outstanding interest rate swaps"}
{"_id": "q8130c3ea", "title": "", "text": "What's the total amount of the Net income for Amount in the years where Operating activities for Total cash provided by (used in) is greater than 1760? (in million)\n\nNet income, Operating activities, Total cash provided"}
{"_id": "q82c08bfa", "title": "", "text": "What is the sum of the Total expenses in the years where Other income is positive? (in million)\n\nTotal expenses, Other income"}
{"_id": "q82834aba", "title": "", "text": "What's the average of Other operations and maintenance in 2018? (in million)\n\nOther operations, maintenance"}
{"_id": "q82e700dc", "title": "", "text": "Which year is Network development services of Costs of operations (exclusive of items shown separately below) the least?\n\nNetwork development services, Costs of operations"}
{"_id": "q84aa0324", "title": "", "text": "Which year is Labor and related benefits the highest?\n\nLabor and related benefits"}
{"_id": "q81e2083a", "title": "", "text": "In the year with largest amount of Gas purchased for resale, what's the increasing rate of Operating revenues?\n\nGas purchased for resale, Operating revenues"}
{"_id": "q830ab982", "title": "", "text": "What is the sum of Target date/risk of FXimpact, Operating leases of Thereafter, and Principal of Total ?\n\nTarget date, risk of foreign exchange impact, operating leases, principal of total"}
{"_id": "q8555209c", "title": "", "text": "what are the total current assets for concentra?\n\ntotal current assets, Concentra"}
{"_id": "q8238d340", "title": "", "text": "What was the average value of theRisk-free interest rate in the years where Expected volatility is positive?\n\naverage value, Risk-free interest rate, Expected volatility"}
{"_id": "q8309ecd2", "title": "", "text": "What do all Proved Developed Reserves sum up in 2013 for U.S. , excluding Synthetic crude oil(mmbbl) and Total proved developed reserves(mmboe)?\n\nProved Developed Reserves, U.S., Synthetic Crude Oil, Total Proved Developed Reserves"}
{"_id": "q82954f30", "title": "", "text": "What's the total amount of Management and financial advice fees, Distribution fees, Net investment income and Premiums in 2012? (in million)\n\nManagement and financial advice fees, Distribution fees, Net investment income, Premiums"}
{"_id": "q82614f00", "title": "", "text": "What's the difference of Distribution fees in GAAP between 2010 and 2009? (in millions)\n\nDistribution fees, GAAP"}
{"_id": "q82def450", "title": "", "text": "what was the change in private equity investments carried at estimated fair value between december 31 , 2015 and december 31 , 2014 , in billions?\n\nprivate equity investments, estimated fair value"}
{"_id": "q8112818c", "title": "", "text": "What is the sum of the Cost of sales in the years where Net sales is greater than 1000? (in million)\n\nCost of sales, Net sales"}
{"_id": "q81baf628", "title": "", "text": "In the year with largest amount of advertising, what's the increasing rate of total revenues? (in %)\n\nadvertising, total revenues, increasing rate"}
{"_id": "q83818904", "title": "", "text": "In the year with the most Equity securities, what is the growth rate of Policy loans? (in %)\n\nEquity securities, growth rate, Policy loans"}
{"_id": "q82ca7a16", "title": "", "text": "What's the sum of Cash provided by operating activities of 2013, Reserve for unearned premiums of 2017 As Reported, and Future policy benefits for life and accident and health insurance contracts of 2017 As Reported ?\n\nCash provided by operating activities, Reserve for unearned premiums, Future policy benefits"}
{"_id": "q835e1cda", "title": "", "text": "What is the total amount of Noninterest income of 2015 Quarters Fourth, Net income of Change Fiscal Year 2019, and Total revenue, net of interest expense of 2016 Quarters Second ?\n\nNoninterest income, Net income, Total revenue, interest expense"}
{"_id": "q82806e08", "title": "", "text": "What is the total amount of the Fee revenue in the year where Total revenue is greater than 13000000?\n\nFee revenue, total revenue"}
{"_id": "q842f82de", "title": "", "text": "Which element for RevPAR exceeds 10% of total in 2006?\n\nRevPAR, total"}
{"_id": "q831774ce", "title": "", "text": "What's the average of the Loans, net for Assets for Carrying Value in the years where Total assets for December 31, is positive?\n\nLoans, net, Assets, Carrying Value"}
{"_id": "q846a7bb4", "title": "", "text": "What's the average of Working capital of 2012, and Monterra del Sol of RentableSquareFootage ?\n\naverage, working capital, Monterra del Sol, Rentable Square Footage"}
{"_id": "q844c5b20", "title": "", "text": "What is the sum of Income from continuing operations for As Reported in 2006? (in million)\n\nIncome from continuing operations"}
{"_id": "q81a6aea2", "title": "", "text": "What's the total amount of U.S. large cap stocks , U.S. small cap stocks, Non-U.S. large cap stocks and Non-U.S. small cap stocks in 2013? (in million)\n\nU.S. large cap stocks, U.S. small cap stocks, Non-U.S. large cap stocks, Non-U.S. small cap stocks"}
{"_id": "q8557bdf2", "title": "", "text": "What is the ratio of Interest expense to the total in 2008? (in %)\n\nInterest expense, total"}
{"_id": "q85cbaa32", "title": "", "text": "how much of the firm-sponsored qspes that hold asf framework loans are serviced by the firm?\n\nfirm-sponsored Qualified Special Purpose Entities, ASF Framework Loans, serviced"}
{"_id": "q852b7a62", "title": "", "text": "What's the total amount of the deferred tax liability in the section where entergy New Orleans is greater than 20? (in thousand)\n\ndeferred tax liability, Entergy New Orleans"}
{"_id": "q81a04d64", "title": "", "text": "What do all elements sum up in 2012 , excluding Gross profit and Operating expenses? (in million)\n\nelements, Gross profit, Operating expenses"}
{"_id": "q8594e628", "title": "", "text": "in 2009 what was the percent of the income tax benefit and the noncontrolling interests of the the company recognized non-cash impairment charges\n\nincome tax benefit, noncontrolling interests, non-cash impairment charges"}
{"_id": "q857834c4", "title": "", "text": "according to the above listed holders of common stock , what was the market share of mktx common stock on march 8 , 2006?\n\nmarket share, common stock, MTKX"}
{"_id": "q8279f0a0", "title": "", "text": "Does Interest-earning deposits with banks (a) keeps increasing each year between 2018 and 2017?\n\nInterest-earning deposits with banks"}
{"_id": "q8299c632", "title": "", "text": "For Three Months Ended Dec 31,which year is Total stock-based compensation greater than 2400 thousand?\n\nTotal stock-based compensation"}
{"_id": "q82e4ee32", "title": "", "text": "What was the average of the Operating Expenses in the years where Revenue is positive? (in million)\n\nOperating Expenses, Revenue"}
{"_id": "q81ad2480", "title": "", "text": "What's the total amount of the 3-Year term loan in 2017 in the years where North America is greater than 300 ?\n\ntotal amount, 3-Year term loan, North America"}
{"_id": "q817bbdbe", "title": "", "text": "what was the percentage change in fuel surcharge revenues from 2011 to 2012?\n\nfuel surcharge revenues"}
{"_id": "q831be112", "title": "", "text": "How many years does total loans in terms of Card Member loans keep growing?\n\ntotal loans, Card Member loans"}
{"_id": "q827f3af6", "title": "", "text": "What is the percentage of Long-term debt in relation to the total for Total contractual obligations ?\n\nLong-term debt, total contractual obligations"}
{"_id": "q81f01e20", "title": "", "text": "In what sections is Required interest on net reserves positive?\n\nRequired interest, net reserves"}
{"_id": "q85a830f2", "title": "", "text": "What is the average value of Operating leases (b) in 2018 ,2019 and 2021? (in million)\n\naverage value, Operating leases"}
{"_id": "q81328eaa", "title": "", "text": "In what year in Gross is Case reserves positive?\n\nGross, Case reserves, positive"}
{"_id": "q83406528", "title": "", "text": "what portion of the securities approved by the security holders remains available for future issunce?\n\nsecurities, security holders, future issuance"}
{"_id": "q81ffb65a", "title": "", "text": "what percentage of citi's home equity portfolio as of december 31 , 2015 was comprised of fixed-rate home equity loans?\n\nCiti, home equity portfolio, fixed-rate home equity loans"}
{"_id": "q813a3eca", "title": "", "text": "What is the sum of CET1 capital, Tier 1 capital and Total capital in 2017? (in million)\n\nCET1 capital, Tier 1 capital, Total capital"}
{"_id": "q81b7d362", "title": "", "text": "Which year is Fair value of plan assets at beginning of year for Non-U.S. the most?\n\nFair value, plan assets, Non-U.S."}
{"_id": "q84c48bea", "title": "", "text": "What is the average amount of No surrender charge of 2010 Individual Variable Annuities, and Net cash used in financing activities of 2009 ?\n\nNo surrender charge, Individual Variable Annuities, Net cash used in financing activities"}
{"_id": "q83e62fc6", "title": "", "text": "What's the average of the Silicon Systems Group in the years where Energy and Environmental Solutions is positive? (in millions)\n\nSilicon Systems Group, Energy and Environmental Solutions"}
{"_id": "q8496d89e", "title": "", "text": "In the section with the most Australia, what is the growth rate of Mill for Australia?\n\ngrowth rate, Mill, Australia"}
{"_id": "q81fb02cc", "title": "", "text": "Which year is Total writedowns in terms of Fixed Maturity Securities the lowest?\n\nTotal writedowns, Fixed Maturity Securities"}
{"_id": "q81e13324", "title": "", "text": "what was the average for \"other\" loans held in 2012 and 2011?\n\naverage, other loans"}
{"_id": "q8135b094", "title": "", "text": "What is the proportion of Pensions' Service cost of of net periodic benefit cost in U.S. Plans to the total in 2006?\n\nPensions, Service cost, net periodic benefit cost, U.S. Plans"}
{"_id": "q81621f8a", "title": "", "text": "In the year with the most Estimated Fair Value in terms of Other, what is the growth rate of Estimated Fair Value of Communications?\n\nEstimated Fair Value, growth rate, Communications"}
{"_id": "q84e0b432", "title": "", "text": "What's the growth rate of Average Balances in terms of Interest-bearing deposits in 2017 Ended December 31?\n\ngrowth rate, Average Balances, Interest-bearing deposits"}
{"_id": "q846bd810", "title": "", "text": "How many Other operations and maintenance exceed the average of Other operations and maintenance in 2018?\n\nOther operations and maintenance"}
{"_id": "q83064186", "title": "", "text": "what was the percentage cumulative total shareholder return on discb for the five year period ended december 31 , 2018?\n\ncumulative total shareholder return, DISC, five year period"}
{"_id": "q84f7717c", "title": "", "text": "What's the growth rate of Total assets for Assumed in 2014?\n\ngrowth rate, Total assets, Assumed"}
{"_id": "q83deb16a", "title": "", "text": "In the section with the most Bank deposits, what is the growth rate of Collateral financing arrangements?\n\nBank deposits, growth rate, Collateral financing arrangements"}
{"_id": "q81b48752", "title": "", "text": "What's the average of the Avalon Terrace, LLC in the years where Town Run Associates is positive?\n\nAvalon Terrace, LLC, Town Run Associates"}
{"_id": "q858f9b64", "title": "", "text": "What's the average of Asset allocation and balanced of December 31,2016, and Operating leases of Thereafter ?\n\nAsset allocation, Operating leases"}
{"_id": "q85627260", "title": "", "text": "What is the proportion of all elements that are greater than 5000 to the total amount of elements in Total contractual obligations?\n\nproportion, total amount, Total contractual obligations"}
{"_id": "q81c6c3c2", "title": "", "text": "What is the sum of the Case reserves in the years in gross where Case reserves is positive? (in million)\n\nCase reserves, gross"}
{"_id": "q85b2aaf0", "title": "", "text": "what was the ratio of the snap-on share repurchase in 2011 compared to 2010\n\nSnap-on, share repurchase"}
{"_id": "q83630e34", "title": "", "text": "What do all Planned net MW in operation sum up without those Planned net MW in operation smaller than 4155, in 2006?\n\nPlanned net MW in operation"}
{"_id": "q82a8646c", "title": "", "text": "What's the average of Curtailments and Settlements and Special termination benefits in 2010? (in million)\n\nCurtailments, Settlements, Special termination benefits"}
{"_id": "q830e4cb4", "title": "", "text": "In the year with largest amount of Other borrowings in terms of Carrying Value, what's the value of Deposits in terms of Carrying Value?\n\nOther borrowings, Carrying Value, Deposits"}
{"_id": "q8137ea08", "title": "", "text": "What is the proportion of Land and land development for Nonperforming Loans andForeclosed Properties-1 to the total in 2011?\n\nLand and land development, Nonperforming Loans, Foreclosed Properties"}
{"_id": "q85601100", "title": "", "text": "What will Depreciation and amortization reach in 2013 if it continues to grow at its current rate? (in thousand)\n\nDepreciation, amortization"}
{"_id": "q852613f6", "title": "", "text": "Which year is Equity securities in Carrying Value the most?\n\nEquity securities, Carrying Value"}
{"_id": "q8292c274", "title": "", "text": "What's the total amount of Securities available for sale, Trading securities, Spot commodities and Trading assets in Carrying Value in 2006? (in millions)\n\nSecurities available for sale, Trading securities, Spot commodities, Trading assets, Carrying Value"}
{"_id": "q851e07e2", "title": "", "text": "What is the average amount of Operating activities of Year Ended December 31, 2007, and Employee separations of Other ?\n\naverage amount, Operating activities, Employee separations"}
{"_id": "q82975596", "title": "", "text": "what is the currency exchange rate cad to usd used to convert the value of the outstanding credit facility as of december 31 , 3006?\n\ncurrency exchange rate, CAD, USD, outstanding credit facility"}
{"_id": "q85224fc8", "title": "", "text": "What's the total amount of Qualifying Accounting Hedges-2 in the range of 0 and 20 in 2010 for Gross Derivative Assets? (in billion)\n\nQualifying Accounting Hedges-2, Gross Derivative Assets"}
{"_id": "q8185ca48", "title": "", "text": "What's the average of the Fuel for Amount in the years where Wheelabrator is positive?\n\nFuel for Amount, Wheelabrator"}
{"_id": "q84aff248", "title": "", "text": "What was the total amount of Securities Commissions and Fees, Interest, Financial Service fees and other in September 30, 2008? (in thousand)\n\nSecurities Commissions and Fees, Interest, Financial Service fees"}
{"_id": "q81ed1eb4", "title": "", "text": "What was the total amount of the adjusted profit in the years / sections where profit of profit before taxes is greater than 5000? (in million)\n\nadjusted profit, profit before taxes"}
{"_id": "q838615fa", "title": "", "text": "What is the percentage of Attritional in relation to the total in 2017 for Total Incurred?\n\nAttritional, Total Incurred"}
{"_id": "q8330ab74", "title": "", "text": "What is the sum of the Other investments for Amount in the sections where Equity securities is positive? (in million)\n\nOther investments, Equity securities"}
{"_id": "q84b195a8", "title": "", "text": "What's the average of Interest expense in 2009? (in thousand)\n\nInterest expense"}
{"_id": "q83701958", "title": "", "text": "Which year is Benefit obligation at beginning of year for Con Edison the least?\n\nBenefit obligation, Con Edison"}
{"_id": "q82e0526e", "title": "", "text": "what is the growth rate in operating profit for space systems in 2011?\n\ngrowth rate, operating profit, space systems"}
{"_id": "q844b4ad2", "title": "", "text": "What is the value of the BALANCE, DECEMBER 31, 2007 for the Treasury Stock ? (in million)\n\nTreasury Stock, balance"}
{"_id": "q81dd8de6", "title": "", "text": "what is the growth rate in net reserves in 2005?\n\ngrowth rate, net reserves"}
{"_id": "q8118067a", "title": "", "text": "In the year with largest amount of government, what's the increasing rate of education?\n\ngovernment, increasing rate, education"}
{"_id": "q85b65ca4", "title": "", "text": "in 2012 what was the ratio of the decline in the provision for commercial lending credit losses to the consumers provision\n\nprovision, commercial lending credit losses, consumers provision"}
{"_id": "q82d7d486", "title": "", "text": "In the year with the most Premiums, what is the growth rate of Interest credited to bank deposits?\n\nPremiums, growth rate, Interest credited, bank deposits"}
{"_id": "q833741dc", "title": "", "text": "In the year with lowest amount of Service cost, what's the increasing rate of Interest cost for Pension Benefits? (in %)\n\nService cost, Interest cost, Pension Benefits"}
{"_id": "q82cf6648", "title": "", "text": "What will Exercise of stock options of Shares reach in 2006 if it continues to grow at its 2005 rate? (in thousand)\n\nExercise of stock options, Shares"}
{"_id": "q832f46d0", "title": "", "text": "What is the percentage of Goodwill in relation to the total on December 31,2016? (in million)\n\nGoodwill, total"}
{"_id": "q84929b12", "title": "", "text": "as of february 8 , 2019 what was the number of shares outstanding\n\nshares outstanding"}
{"_id": "q83ae5cae", "title": "", "text": "In the year with the most Group Retirement Products*, what is the growth rate of Individual Fixed Annuities ? (in %)\n\nGroup Retirement Products, growth rate, Individual Fixed Annuities"}
{"_id": "q824005e8", "title": "", "text": "What's the sum of Distribution fees in the range of 1000 and 2000 in 2011? (in million)\n\nDistribution fees"}
{"_id": "q8141e512", "title": "", "text": "What is the average amount of Case reserves of 2008 Net, and Exercise of stock options of 2008 ?\n\naverage amount, Case reserves, Exercise of stock options"}
{"_id": "q8356d650", "title": "", "text": "What is the average amount of Client deposits of Average Balance Year Ended December 31, 2014, and U.S. of As of December 31, 2014 ?\n\nClient deposits, Average Balance"}
{"_id": "q83795414", "title": "", "text": "what is the highest total amount of Product revenues, net in 2014?? (in million)\n\nProduct revenues, net"}
{"_id": "q83f7e374", "title": "", "text": "Which section is Total fixed rate debt the most?\n\nTotal fixed rate debt"}
{"_id": "q853121e2", "title": "", "text": "What is the ratio of all Year Ended October 31, that are in the range of 0 and 5 in 2017?\n\nYear Ended October 31, ratio"}
{"_id": "q85c4c69a", "title": "", "text": "how much has the balance changed from 2013 to 2015?\n\nbalance change"}
{"_id": "q810dcafc", "title": "", "text": "What is the average value of Total revenues in Table 2 and Restricted stock awards in Table 1 in 2007? (in million)\n\nTotal revenues, Restricted Stock Awards"}
{"_id": "q859ca02a", "title": "", "text": "What is the proportion of all March 31 of Three months ended that are greater than 6000 to the total amount of March 31 of Three months ended in 2005?\n\nproportion, March 31, Three months ended, total amount"}
{"_id": "q838f1d1c", "title": "", "text": "If Swaps in terms of Interest rate contracts with Contract/ Notional develops with the same growth rate in 2005, what will it reach in 2006? (in dollars in millions)\n\nSwaps, Interest Rate Contracts, Contract, Notional"}
{"_id": "q82715706", "title": "", "text": "What was the total amount of Square Feet-1 /Apartment Units excluding those Square Feet-1 /Apartment Units greater than 100000 for Square Feet-1 /Apartment Units?\n\ntotal amount, Square Feet-1, Apartment Units"}
{"_id": "q820916b4", "title": "", "text": "In which year is Intangible amortization expense more than 17 million?\n\nIntangible amortization expense"}
{"_id": "q831f9cee", "title": "", "text": "What's the total value of all net income for before consolidation that are in the range of 10 and 600 in 2010? (in million)\n\nnet income, consolidation"}
{"_id": "q82561284", "title": "", "text": "for the derivative contracts , assuming an average contract life of 10 years , what would annual exposure be in us$ billion at december 31 , 2005 on derivative receivables?\n\nderivative contracts, annual exposure, derivative receivables"}
{"_id": "q851b989a", "title": "", "text": "What was the total amount of the Interest expense to affiliates in the section where the Expenses on Support services is greater than 600 million? (in million)\n\nInterest expense, affiliates, Expenses on Support services"}
{"_id": "q859f47e4", "title": "", "text": "Does the value of Assets (b) in 2014 greater than that in 2015 for BALANCESHEETHIGHLIGHTS?\n\nAssets, BALANCESHEET HIGHLIGHTS"}
{"_id": "q813e06ae", "title": "", "text": "by what percentage did the aeco natural gas sales index decline from 2011 to 2013?\n\nAECO natural gas sales index, decline"}
{"_id": "q813ebad6", "title": "", "text": "What is the ratio of all amount that are smaller than 100 to the sum of amount, in 2008? (in %)\n\nratio, amount, sum"}
{"_id": "q85c3554e", "title": "", "text": "What is the growing rate of Other in Table 0 in the year with the most Industrial of Rental Expenses in Table 1?\n\ngrowing rate, Other, Industrial Rental Expenses"}
{"_id": "q8293450a", "title": "", "text": "What is the ratio of Operating lease obligations to Total contractual obligations in 1-3 years?\n\nOperating lease obligations, Total contractual obligations"}
{"_id": "q81f5dc5c", "title": "", "text": "How many kinds of Gross are greater than 10 in for Natural Gas Wells?\n\nGross, Natural Gas Wells"}
{"_id": "q8498c0dc", "title": "", "text": "If Office for Nonperforming Loans andForeclosed Properties-1 develops with the same growth rate in 2011 what will it reach in 2012? (in million)\n\nOffice for Nonperforming Loans, Foreclosed Properties, growth rate"}
{"_id": "q85536af4", "title": "", "text": "What is the growing rate of Residential real estate of Recoveries in the year with the least Commercial real estate of Gross charge-offs?\n\nResidential real estate, Recoveries, Commercial real estate, Gross charge-offs"}
{"_id": "q81a42bd2", "title": "", "text": "What is the growing rate of Earnings (loss) before taxes in Total in the years with the least Federal/foreign in Total?\n\nEarnings before taxes, Federal/foreign"}
{"_id": "q817d44ae", "title": "", "text": "What's the sum of Unvested at December 31, 2018 of Shares, and Adjusted balance, beginning of period of Benefit plans ?\n\nUnvested Shares, Adjusted balance, Benefit plans"}
{"_id": "q814a38fc", "title": "", "text": "How many elements for Issued of Common Stock show negative value in 2004?\n\nIssued of Common Stock, negative value"}
{"_id": "q815592a6", "title": "", "text": "Which Revenues and other income occupies the greatest proportion in total amount in 2007?\n\nRevenues, other income, total amount"}
{"_id": "q82a77912", "title": "", "text": "what is the percentage change in research and development expense from 2015 to 2016?\n\nresearch and development expense"}
{"_id": "q84f63fc8", "title": "", "text": "what was the percentage change in the repurchase reserve between 2008 and 2009 , in millions?\n\nrepurchase reserve, percentage change"}
{"_id": "q83d8e992", "title": "", "text": "What is the sum of purchased impaired in the range of 200 and 3000 in 2011? (in million)\n\npurchased impaired"}
{"_id": "q84dfc8d8", "title": "", "text": "If Net interest income develops with the same increasing rate in 2010, what will it reach in 2011? (in million)\n\nNet interest income"}
{"_id": "q84657c4a", "title": "", "text": "what is the growth rate in net revenue for entergy texas , inc . in 2007?\n\ngrowth rate, net revenue, Entergy Texas, Inc."}
{"_id": "q82b76e4e", "title": "", "text": "At December 31, 2015,what is the Gross Unrealized Gains for Total corporate securities? (in million)\n\nGross Unrealized Gains, Total Corporate Securities"}
{"_id": "q85b1cc34", "title": "", "text": "What's the current growth rate of Exercise of stock options of Shares?\n\ngrowth rate, Exercise of Stock Options, Shares"}
{"_id": "q81755c30", "title": "", "text": "what's the total amount of U.S. of As of December 31, 2014, and Client deposits of December 31, 2014 ?\n\ntotal amount, U.S., Client deposits"}
{"_id": "q85ab8388", "title": "", "text": "What is the growing rate of Average selling price per product ton in the years with the least Granular urea?\n\ngrowing rate, Average Selling Price, Granular Urea"}
{"_id": "q815e5a4e", "title": "", "text": "Does the average value of Loans and leases in 2014 greater than that in 2013\n\naverage value, Loans, leases"}
{"_id": "q82b647e4", "title": "", "text": "What is the sum of Other in 2005 and Bond trading securities, at fair value of Asset Management in 2008? (in million)\n\nOther, Bond trading securities, Asset Management"}
{"_id": "q82ba7094", "title": "", "text": "what is the net income per common share for the year 2007?\n\nnet income per common share"}
{"_id": "q84479edc", "title": "", "text": "What's the sum of Trading account liabilities without those Trading account liabilities smaller than 15000, in 2010? (in million)\n\nTrading account liabilities"}
{"_id": "q84a7c2da", "title": "", "text": "What is the growing rate of Equity securities, trading for Carrying amount in the year with the most Fixed maturities, available-for-sale ?\n\nEquity securities, trading, Fixed maturities, available-for-sale"}
{"_id": "q83c1d5fe", "title": "", "text": "If the amount of Equity securities develops with the same growth rate in 2009 Ended December 31, what will it reach in 2010 Ended December 31? (in million)\n\nEquity securities, growth rate"}
{"_id": "q823ada82", "title": "", "text": "What is the growing rate of Total costs and expenses in the year with the most Total revenue?\n\nTotal costs and expenses, Total revenue"}
{"_id": "q83789aba", "title": "", "text": "what's the total amount of Basic net income available for common shareholders of 2007, and 2025 of Industrial SquareFeet 8,028 12,303 13,525 12,567 13,042 ?\n\nBasic net income, common shareholders, Industrial SquareFeet"}
{"_id": "q824c1b1c", "title": "", "text": "What is the growing rate of Annual in the years with the least As of January 1 for Number of Awards\n\nAnnual, Number of Awards"}
{"_id": "q8224dd2c", "title": "", "text": "What is the amount of the positive term of the total mortgage and other loans receivable, net of allowance in 2016? (in dollars in millions)\n\ntotal mortgage, loans receivable, allowance"}
{"_id": "q825e6902", "title": "", "text": "what is the annualized return for the investment in the allegion plc during 2013-2017?\n\nannualized return, investment, Allegion plc"}
{"_id": "q843a7680", "title": "", "text": "In the year with the most Originally reported net reserves for unpaid claim and claim adjustmentexpenses, what is the growth rate of One year later?\n\nnet reserves, unpaid claims, claim adjustment expenses, growth rate"}
{"_id": "q81658e0e", "title": "", "text": "what is the percentage change in rent expense for operating leases from 2001 to 2002?\n\nrent expense, operating leases"}
{"_id": "q83ccbc6c", "title": "", "text": "As As the chart 0 shows,which year is the value of the Asset- backed securities on December 31 the lowest?\n\nAsset-backed securities"}
{"_id": "q82b95e3e", "title": "", "text": "as of december 31 , 2015 , what was the percentage of the loans extended under home equity lines of credit in the citi 2019s home equity loan portfolio\n\nhome equity lines of credit, Citigroup, home equity loan portfolio"}
{"_id": "q84ccfd52", "title": "", "text": "Which year is Total marketing, promotion, rewards and Card Member services and other the lowest?\n\nTotal marketing, promotion, rewards, Card Member services"}
{"_id": "q815f474c", "title": "", "text": "What's the sum of Fixed income in 2015? (in millions)\n\nFixed income"}
{"_id": "q813f92c6", "title": "", "text": "What will active in equity be like in 2018 if it develops with the same increasing rate as current? (in million)\n\nactive in equity"}
{"_id": "q85b4b5f2", "title": "", "text": "What is the growing rate of Commission and brokerage in the year with the most Incurred losses and LAE?\n\nCommission, brokerage, Incurred losses, Loss Adjustment Expense"}
{"_id": "q84ee81ac", "title": "", "text": "Does Structured notes keeps increasing each year between 2015 and 2016?\n\nStructured notes"}
{"_id": "q857f863e", "title": "", "text": "In the year with the most Other, what is the growth rate of Communications?\n\ngrowth rate, Communications"}
{"_id": "q84e42a22", "title": "", "text": "what was the percentage change in share-based compensation expense between 2011 and 2012?\n\nshare-based compensation expense"}
{"_id": "q856a557a", "title": "", "text": "as of dec 31 , 2009 , what was the average loan commitment for the company for all of its total loan commitments , in millions>\n\naverage loan commitment, total loan commitments"}
{"_id": "q8578f08a", "title": "", "text": "What was the average of the Net current-period other comprehensive income in the years where Other comprehensive income before reclassifications for Changes related to cash flow derivative hedges is positive?\n\nNet current-period other comprehensive income, Other comprehensive income, cash flow derivative hedges"}
{"_id": "q81dfb1fc", "title": "", "text": "What's the sum of the Municipal bonds for Available-for-sale debt securities for TotalFair Value in the years where Total segment revenu is greater than 1700? (in million)\n\nMunicipal bonds, Available-for-sale debt securities, Total Fair Value, Total segment revenue"}
{"_id": "q8575d724", "title": "", "text": "What's the 25% of the value of Net plan assets totally as of December 31, 2017? (in million)\n\nNet plan assets"}
{"_id": "q839bdb2e", "title": "", "text": "What is the growing rate of distribution fees in table 1 in the year with the most Other revenues in table 1?\n\ngrowing rate, distribution fees, Other revenues"}
{"_id": "q82c77ef6", "title": "", "text": "what was the percentage change in cash provided by operating activities from 2008 to 2009?\n\ncash provided by operating activities"}
{"_id": "q82824750", "title": "", "text": "What's the greatest value of Fixed income in 2015? (in millions)\n\nFixed income"}
{"_id": "q83141e00", "title": "", "text": "What is the average value of Total assets and Corporate and other bonds for Fixed maturity securities for Total in 2016? (in million)\n\nTotal assets, Corporate bonds, Fixed maturity securities"}
{"_id": "q839de626", "title": "", "text": "How many element exceed the average of Total long-term unsecured funding and Structured notes in 2016?\n\nTotal long-term unsecured funding, Structured notes"}
{"_id": "q833d3cb8", "title": "", "text": "what percentage of non-cash impairment charges came from real estate under development?\n\nnon-cash impairment charges, real estate under development"}
{"_id": "q84747074", "title": "", "text": "What's the total amount of Interest, Operating leases, Purchase obligations and Investment commitments in 2018? (in millions)\n\nInterest, Operating leases, Purchase obligations, Investment commitments"}
{"_id": "q825f6758", "title": "", "text": "what is the growth rate of net sales from 2014 to 2015?\n\ngrowth rate, net sales"}
{"_id": "q83741de6", "title": "", "text": "Which year is Average contracted price per MWh the most?\n\nAverage contracted price, MWh"}
{"_id": "q80ed48b8", "title": "", "text": "Which year is Total Revenues of Group retirement products the most?\n\nTotal Revenues, Group Retirement Products"}
{"_id": "q81bf3fbc", "title": "", "text": "what is the basic net income ( loss ) attributable to common shareholders as a percentage of diluted net income ( loss ) attributable to common shareholders in 2008?\n\nbasic net income, diluted net income, common shareholders"}
{"_id": "q835f8944", "title": "", "text": "What is the growing rate of Planned generation (TWh) in the year with the most Average contracted price per MWh?\n\ngrowing rate, Planned generation, Average contracted price, MWh"}
{"_id": "q83a9a06a", "title": "", "text": "What's the total value of all elements for Total consumer recoveries that are in the range of 200 and 500 in 2016? (in million)\n\nTotal consumer recoveries"}
{"_id": "q84a910ea", "title": "", "text": "What is the percentage of all Components of net periodic benefit cost that are positive to the total amount, in 2009 for Qualified plan?\n\nComponents of net periodic benefit cost, Qualified plan"}
{"_id": "q83c12e24", "title": "", "text": "What's the average of the Cash equivalents, primarily money market funds for Assets for TotalFair Value in the years where Product revenue is greater than 840? (in million)\n\nCash equivalents, money market funds, Total Fair Value, Product revenue"}
{"_id": "q817946ba", "title": "", "text": "What is the sum of Revenues in 2008 on September 30 ? (in thousand)\n\nRevenues"}
{"_id": "q83adb6b4", "title": "", "text": "In which section the sum of Foreign government bonds has the highest value?\n\nForeign government bonds, highest value"}
{"_id": "q83916586", "title": "", "text": "What is the growing rate of Gross profit in the year with the most Net revenues ?\n\nGross profit, Net revenues"}
{"_id": "q854dade4", "title": "", "text": "Which year is Catastrophes for Prior Years the lowest?\n\nCatastrophes, Prior Years"}
{"_id": "q84fcfe76", "title": "", "text": "What is the ratio of Greater than twelve to twenty-four months for Carrying amount of Private to the total in 2009?\n\nCarrying amount, Private, ratio"}
{"_id": "q8110aa4c", "title": "", "text": "What is the sum of Aircraft on Firm Order in 2009?\n\nAircraft on Firm Order"}
{"_id": "q8325cd44", "title": "", "text": "What is the total amount of U.S. credit card Loans and leases charged off of 2014, Cash proceeds from new securitizations of Residential Mortgage Agency 2016, and Allowance for loan and lease losses, December 31 Recoveries of loans and leases previously charged off of 2013 ?\n\nU.S. credit card loans, leases, securitizations, allowance for loan and lease losses"}
{"_id": "q84d6fd98", "title": "", "text": "What was the value of the Gross margin in the year where Sales volume by product tons (000s) is positive? (in million)\n\nGross margin, Sales volume, product tons"}
{"_id": "q8394d504", "title": "", "text": "What is the total amount of Vested of Years Ended December 31, 2017 Shares, and Beginning of period reserves of At December 31, 2015 ?\n\nVested Shares, Beginning of period reserves"}
{"_id": "q81e2db2a", "title": "", "text": "What do all Net income (loss) attributable to noncontrolling interests sum up, excluding those negative ones in 2010 ? (in million)\n\nNet income attributable to noncontrolling interests"}
{"_id": "q8395cba8", "title": "", "text": "what is the percentage change in weighted average common shares outstanding for basic computations from 2017 to 2018?\n\npercentage change, weighted average common shares outstanding, basic computations"}
{"_id": "q8174dbe8", "title": "", "text": "What is the difference between the greatest Sales Volumes in 2009 and 2008？\n\nSales Volumes"}
{"_id": "q85173688", "title": "", "text": "What will U.S. high-grade be like in 2005 if it develops with the same increasing rate as current? (in thousand)\n\nU.S. high-grade"}
{"_id": "q82548a7c", "title": "", "text": "What was the total amount of the Income from continuing operations in the years where Income taxes is greater than 1000? (in million)\n\nIncome from continuing operations, Income taxes"}
{"_id": "q83c9a2b6", "title": "", "text": "What is the ratio of Policy loans of Assets to the total in 2010 for Fair Value?\n\nPolicy loans, Assets, Fair Value"}
{"_id": "q845db7b2", "title": "", "text": "In the year with largest amount of Total loans and leases in table1, what's the sum of total assets in table 1? (in millions)\n\nTotal loans and leases, total assets"}
{"_id": "q82e826f6", "title": "", "text": "At December 31, 2015,how much is the Gross Unrealized Gains for Technology Corporate securities less than the Gross Unrealized Gains for Total corporate securities? (in million)\n\nGross Unrealized Gains, Technology Corporate securities, Total corporate securities"}
{"_id": "q84596c52", "title": "", "text": "considering the year 2013 , what was the percentual increase in the actual return on assets compared with the expected return?\n\nreturn on assets, actual return, expected return"}
{"_id": "q83608a24", "title": "", "text": "what was the change in the weighted average common shares outstanding for diluted computations from 2017 to 2018\n\nweighted average common shares outstanding, diluted computations"}
{"_id": "q81694e0e", "title": "", "text": "What's the sum of Seattle Metro of As of December 31, 2010 Apartment Units, and Huntington Breakers of RentableSquareFootage ?\n\nSeattle Metro, Apartment Units, Huntington Breakers, Rentable Square Footage"}
{"_id": "q8334e644", "title": "", "text": "What's the average of Amount for Credit Card (a) in 2012? (in million)\n\naverage, Amount, Credit Card"}
{"_id": "q82cb6124", "title": "", "text": "What's the total amount of Management and financial advice fees, Distribution fees, Net investment income and Other revenues in 2009? (in millions)\n\nManagement and financial advice fees, Distribution fees, Net investment income, Other revenues"}
{"_id": "q83d7cdfa", "title": "", "text": "What's the average of Notes payable, including accrued interest of Less than 1 year, and Gross written premiums of Years Ended December 31, 2012 ?\n\nNotes payable, accrued interest, Gross written premiums"}
{"_id": "q830cceac", "title": "", "text": "What is the sum of Elba Express and FEP in MilesofPipeline?\n\nElba Express, FEP, Miles of Pipeline"}
{"_id": "q819b3022", "title": "", "text": "what is the profit margin in 2018?\n\nprofit margin"}
{"_id": "q84ec400e", "title": "", "text": "What was the average of the Efficiency for SELECTEDRATIOS in the years where Assets (b) is positive for BALANCESHEETHIGHLIGHTS? (in million)\n\nEfficiency, SELECTED RATIOS, Assets, BALANCE SHEET HIGHLIGHTS"}
{"_id": "q810b75d6", "title": "", "text": "What is the ratio of Total cards-in-force in Table 1 to the Other in Table 0 in 2016?\n\nTotal cards-in-force, Other"}
{"_id": "q80f1979c", "title": "", "text": "What is the ratio of Securities to the total for Net realized losses reclassified into earnings in 2008?\n\nSecurities, Net realized losses, earnings"}
{"_id": "q824e9e1e", "title": "", "text": "What is the total amount of Investments of consolidated investment products of 2010, and California of Number ofCustomers ?\n\nInvestments, consolidated investment products, California, Number of Customers"}
{"_id": "q858d93f0", "title": "", "text": "Does the average value of Services in 2012 greater than that in 2011?\n\naverage value, Services"}
{"_id": "q846e9500", "title": "", "text": "What is the ratio of all elements for Total consumer recoveries that are range of 200 and 500 to the sum of elements, in 2016?\n\nTotal consumer recoveries, sum of elements"}
{"_id": "q85acc7b6", "title": "", "text": "In the year with the most Registered investment companies, what is the growth rate of Total plan assets, subject to leveling in level1？\n\nRegistered investment companies, growth rate, Total plan assets"}
{"_id": "q84a39dcc", "title": "", "text": "What is the total amount of Canada INTERNATIONAL OFFICES— of 2006, Operating leases of Less Than 1 Year, and Client claims and refunds of 2016 ?\n\nCanada, INTERNATIONAL OFFICES, Operating leases, Client claims and refunds"}
{"_id": "q8202f964", "title": "", "text": "What is the sum of investment income in the range of 100 and 1000 in 2014? (in million)\n\ninvestment income"}
{"_id": "q831648ba", "title": "", "text": "What was the average value of the Income taxes payable in the years where Net earnings is positive?\n\naverage value, Income taxes payable, Net earnings"}
{"_id": "q82eca4f6", "title": "", "text": "commercial mortgage loans held for sale designated at fair value at december 31 , 2012 were what percent of total loans held for sale?,\n\ncommercial mortgage loans, fair value, total loans held for sale"}
{"_id": "q82f0879c", "title": "", "text": "The total amount of which section ranks first for AmortizedCost or Cost for Fixed maturities? (in million)\n\nAmortized Cost, Fixed maturities"}
{"_id": "q815c4f74", "title": "", "text": "when pnc redeemed all shares of the series m preferred stock from the trust on december 10 , 2012 , what was the total cash cost of the redemption?\n\nPNC, Series M Preferred Stock, cash cost, redemption"}
{"_id": "q856f7f3c", "title": "", "text": "What's the average of Group Retirement Products* and Individual Fixed Annuities and Individual Fixed Annuities in 2010? (in million)\n\nGroup Retirement Products, Individual Fixed Annuities"}
{"_id": "q8558d53e", "title": "", "text": "What do all Trading securities debt sum up, excluding those negative ones in 2009 for Trading securities debt? (in million)\n\nTrading securities debt"}
{"_id": "q81a5d414", "title": "", "text": "What is the sum of Gross written premiums, Net written premiums and Premiums earned in 2013? (in million)\n\nGross written premiums, Net written premiums, Premiums earned"}
{"_id": "q84d939e6", "title": "", "text": "as december 312011 what was the amount of the provision for impairment in billion\n\nprovision for impairment"}
{"_id": "q8275aab8", "title": "", "text": "what is the yearly interest income generated by the collateralized credit facility provided to the real estate company for the execution of its property acquisitions program , in million cad?\n\nyearly interest income, collateralized credit facility, real estate company, property acquisitions program"}
{"_id": "q8368b294", "title": "", "text": "what was the percentual return for s&p 500 in the first year?\n\npercentual return, S&P 500"}
{"_id": "q83a81560", "title": "", "text": "what's the total amount of Private equity/venture capital of December 31, 2010, and Operating profit of 2015 ?\n\nPrivate equity, venture capital, Operating profit"}
{"_id": "q83d06268", "title": "", "text": "What do all Commercial realestate sum up, excluding those negative ones for Net Charge-offs / (Recoveries)? (in million)\n\nCommercial real estate, Net Charge-offs, Recoveries"}
{"_id": "q84674e44", "title": "", "text": "What was the average of the Risk-weighted in the years where Total capital is positive? (in million)\n\naverage, Risk-weighted, Total capital"}
{"_id": "q83d346a4", "title": "", "text": "what is the increase in rent expense from 2008 to 2009?\n\nrent expense"}
{"_id": "q83244604", "title": "", "text": "What is the sum of Policy fees of Years Ended December 31, 2011, and Retained interest in AIA of 2011 ?\n\nPolicy fees, Retained interest, AIA"}
{"_id": "q83fc49be", "title": "", "text": "What is the sum of Europe of Year Ended December 31, 2007, Retained earnings of December 31, 2014 As Revised, and Total of Year Ended December 31, 2008 ?\n\nEurope, Retained earnings, Total"}
{"_id": "q83f1df74", "title": "", "text": "What is the growing rate of Fuel in the year with the most Electric?\n\ngrowing rate, Fuel, Electric"}
{"_id": "q8524fb92", "title": "", "text": "What's the average of Business separation costs,Business restructuring and cost reduction actions and Pension settlement loss in terms of Operating Income in 2016?\n\nBusiness separation costs, Business restructuring, Pension settlement loss, Operating Income"}
{"_id": "q81e99668", "title": "", "text": "What's the average of total loan in 2011? (in million)\n\ntotal loan"}
{"_id": "q85518540", "title": "", "text": "what was the average rental expense in millions for 2000 through 2002?\n\naverage rental expense"}
{"_id": "q84f69ce8", "title": "", "text": "In what year is profit of profit before taxes greater than 5000?\n\nprofit before taxes"}
{"_id": "q8315483e", "title": "", "text": "in 2008 what was the approximate tax rate on the company recorded an aggregate net unrealized loss\n\ntax rate, aggregate net unrealized loss"}
{"_id": "q834a723e", "title": "", "text": "What is the growing rate of Residential mortgage in the years with the least Home equity ？\n\nResidential mortgage, Home equity, growing rate"}
{"_id": "q819acb82", "title": "", "text": "What is the ratio of Commercial – domestic to the total in 2009?\n\nCommercial – domestic, total"}
{"_id": "q8196f2c8", "title": "", "text": "what is the growth rate in net reserves in 2006?\n\ngrowth rate, net reserves"}
{"_id": "q832a542c", "title": "", "text": "what is the percentage change in research and development expense from 2016 to 2017?\n\nresearch and development expense"}
{"_id": "q822a8e84", "title": "", "text": "how much were investment advisory revenues in 2007 , in millions of dollars?\n\ninvestment advisory revenues"}
{"_id": "q835308a4", "title": "", "text": "In the year with the most Interest rate swaps for Assets, what is the growth rate of Interest rate floors for Assets?\n\nInterest rate swaps, growth rate, Interest rate floors, Assets"}
{"_id": "q84bd152c", "title": "", "text": "What is the ratio of Cost of sales to the total in 2016?\n\nCost of sales, total"}
{"_id": "q84433acc", "title": "", "text": "what is the ratio of perfomance shares as a percent of the total number of granted shares?\n\nperformance shares, total number of granted shares"}
{"_id": "q85c1337c", "title": "", "text": "What do all Revenues, net of interest expense sum up, excluding those negative ones in 2010? (in million)\n\nRevenues, net of interest expense"}
{"_id": "q85c7f16c", "title": "", "text": "what percent of warehouse locations are located in japan .\n\nwarehouse locations, Japan"}
{"_id": "q833927cc", "title": "", "text": "What's the total value of all Year Ended October 31, that are in the range of 0 and 5 in 2017? (in million)\n\ntotal value, Year Ended October 31"}
{"_id": "q84a0ac02", "title": "", "text": "during 2009 , refineries a total of how much processed total crude and other charge and blend stocks , in mbpd?\n\nrefineries, processed total crude, charge and blend stocks, mbpd"}
{"_id": "q85a31fae", "title": "", "text": "what is the growth rate for backlog at year-end from 2015 to 2016?\n\ngrowth rate, backlog"}
{"_id": "q83f387fc", "title": "", "text": "What is the average value of Loans held for sale in 2012, 2011, and 2010 ? (in million)\n\naverage value, Loans held for sale"}
{"_id": "q826aa5b4", "title": "", "text": "Does Net earnings in As Reported keeps increasing each year between 2013 and 2014 ?\n\nNet earnings, As Reported"}
{"_id": "q81a4d2c6", "title": "", "text": "What is the growing rate of Active and other in the years with the least Company stock/ESOP?\n\ngrowing rate, Active, Company stock, ESOP"}
{"_id": "q82729904", "title": "", "text": "What's the average of U.S. Plans in 2016 for Pension?\n\naverage, U.S. Plans, Pension"}
{"_id": "q84acf93a", "title": "", "text": "What's the sum of all elements that are greater than 10 in Home equity?\n\nHome equity"}
{"_id": "q84331f2a", "title": "", "text": "What's the average of Property and equipment, net and Total assets in 2012? (in thousand)\n\nProperty and equipment, Total assets"}
{"_id": "q859adda8", "title": "", "text": "What is the ratio of Marketplaces to the total in 2009?\n\nMarketplaces, total"}
{"_id": "q81f1664a", "title": "", "text": "what was total stock-based performance unit awards expense in 2018 , 2017 , and 2016 , in millions?\n\nstock-based performance unit awards expense"}
{"_id": "q827ba378", "title": "", "text": "in millions , how much compensation expense was attributable to directors in the years ended december 31 , 2015 through 2017?\n\ncompensation expense, directors"}
{"_id": "q83b44f88", "title": "", "text": "Does other of Revenues in millions keeps increasing each year between 2016 and 2017?\n\nRevenues, millions"}
{"_id": "q85411d0e", "title": "", "text": "What was the total amount of Foreign govt./govt. agencies, Municipal, RMBS and U.S. Treasuries for Fair of 12 Months or More ?\n\nForeign government, government agencies, Municipal, RMBS, U.S. Treasuries"}
{"_id": "q84f8482c", "title": "", "text": "In the year with lowest amount of CECONY full service customers, what's the increasing rate of Delivery service for retail choice customers?\n\nCECONY, Delivery service, retail choice customers"}
{"_id": "q82604074", "title": "", "text": "what is the percentage increase in rsus from 2009 to 2010?\n\npercentage increase, Restricted Stock Units"}
{"_id": "q82a3a3f0", "title": "", "text": "In the section with lowest amount of Net interest income, what's theamount of Net interest income and Total revenue, net of interest expense? (in millions)\n\nNet interest income, Total revenue, interest expense"}
{"_id": "q816f0236", "title": "", "text": "What is the sum of Premiums in 2012 and Negotiated amount in 2011? (in million)\n\nPremiums, Negotiated amount"}
{"_id": "q84b879fe", "title": "", "text": "what is the total value of the issued securities approved by security holders , ( in millions ) ?\n\ntotal value, issued securities, security holders"}
{"_id": "q83b92f6c", "title": "", "text": "What's the average of Earnings from operations of 2015, and Pension and other postretirement cash requirements of After 5years ?\n\nEarnings from operations, Pension, postretirement cash requirements"}
{"_id": "q82aa4520", "title": "", "text": "what is the annual amortization expense related to customer relationships , in millions?\n\nannual amortization expense, customer relationships"}
{"_id": "q8386beba", "title": "", "text": "what is the total mw capacity of the boiling water reactors?\n\ntotal, megawatt capacity, boiling water reactors"}
{"_id": "q847f8694", "title": "", "text": "What is the proportion of Residential Mortgage Loans to the total for 1 Year or Less ? (in %)\n\nResidential Mortgage Loans, total"}
{"_id": "q836795c6", "title": "", "text": "In the year with largest amount of Securities America, Inc.-3(4) for Actual Capital, what's the sum of Threadneedle-6 ? (in million)\n\nSecurities America, Inc., Actual Capital, Threadneedle"}
{"_id": "q83837aac", "title": "", "text": "What was the total amount of the Commercial Banking in the sections where Investment Bank is greater than 1000? (in million)\n\nCommercial Banking, Investment Bank"}
{"_id": "q811437fc", "title": "", "text": "What is the sum amount of Capital lease obligations in the years with the lowest amount of Operating lease obligations? (in dollars in millions)\n\nCapital lease obligations, Operating lease obligations"}
{"_id": "q856edda2", "title": "", "text": "What is the Total value of Cost or Amortized Cost for Aaa?\n\nTotal value, Cost, Amortized Cost, Aaa"}
{"_id": "q81673f24", "title": "", "text": "What's the sum of Construction Payable of Estimated Fair Value, and Net sales of 2013 ?\n\nConstruction Payable, Estimated Fair Value, Net sales"}
{"_id": "q8373aeec", "title": "", "text": "What was the average of Collection:Total Collection in 2008,2007 and 2006 ?\n\nCollection, Total Collection"}
{"_id": "q81701b30", "title": "", "text": "What is the sum of the General, administrative and other expenses in the years where Production expenses, including related taxes is greater than 100? (in million)\n\nGeneral expenses, administrative expenses, other expenses, Production expenses"}
{"_id": "q82739688", "title": "", "text": "What is the percentage of Net occupancy in relation to the total in 2005? (in %)\n\nNet occupancy, total"}
{"_id": "q8250cb62", "title": "", "text": "What is the sum of value in the range of 400 and 1000 in 2011? (in million)\n\nsum, value"}
{"_id": "q8111431c", "title": "", "text": "In which year is Other Expense greater than 30000?\n\nOther Expense"}
{"_id": "q82bbf4aa", "title": "", "text": "When is Earnings (loss) before taxes in Total the largest?\n\nEarnings before taxes, Total"}
{"_id": "q820c112a", "title": "", "text": "what's the total amount of Debt maturities of Thereafter, Operating lease obligations of More than 5 years is, and Total of Thereafter ?\n\nDebt maturities, Operating lease obligations, Total"}
{"_id": "q843f9840", "title": "", "text": "What will Purchase of minerals in-place reach in 2014 if it continues to grow at its current rate? (in thousand)\n\nPurchase of minerals in-place"}
{"_id": "q811fbd20", "title": "", "text": "as of february 19 , 2016 what was the market capitalization\n\nmarket capitalization"}
{"_id": "q82eed906", "title": "", "text": "What is the total value of Professional fees, Personnel, Data processing and telecommunications and Foreign exchange activity1 in 2018? (in million)\n\ntotal value, Professional fees, Personnel, Data processing, telecommunications, Foreign exchange activity"}
{"_id": "q81f9f8be", "title": "", "text": "In the year with lowest amount of Interest in table 2, what's the increasing rate of Operating leases in table 2?\n\nInterest, Operating leases"}
{"_id": "q818096a4", "title": "", "text": "What's the average of Employee separations of Liability as of December 31, 2005, and Investing activities of Year Ended December 31, 2006 ?\n\nEmployee separations, Liability, Investing activities"}
{"_id": "q8380395a", "title": "", "text": "what is the percentage change in weighted average common shares outstanding for diluted computations from 2015 to 2016?\n\nweighted average common shares outstanding, diluted computations"}
{"_id": "q81ca2b0c", "title": "", "text": "How many loans exceed the average of total loans in 2011?\n\nloans, average, total loans"}
{"_id": "q85270e8c", "title": "", "text": "What is the total value of Granted Exercised - Canceled and Expired in 2006 for Options For Shares?\n\nGranted Exercised, Canceled, Expired, Options For Shares"}
{"_id": "q847e2c36", "title": "", "text": "If Segment net sales develops with the same growth rate in 2012, what will it reach in 2013? (in million)\n\nSegment net sales, growth rate"}
{"_id": "q85543eb6", "title": "", "text": "Which year is Interruptible sales in thousands of Dt Delivered the lowest?\n\nInterruptible sales, Dt Delivered"}
{"_id": "q82dba4da", "title": "", "text": "What is the total amount of Corporate notes and bonds of 2010 Fair Value, and Net sales of 2011 ?\n\nCorporate notes and bonds, Fair Value, Net sales"}
{"_id": "q8595bfee", "title": "", "text": "What's the total value of all elements that are smaller than 15000 in Balance at December 31, 2007-1? (in million)\n\ntotal value, Balance"}
{"_id": "q82d3e286", "title": "", "text": "What's the sum of all Unaffiliated customers that are greater than 2000 in 2010? (in million)\n\nUnaffiliated customers"}
{"_id": "q830dae8a", "title": "", "text": "Without Management and financial advice fees and Distribution fees, how much of Revenues is there in total in 2009? (in million)\n\nRevenues"}
{"_id": "q81e7a268", "title": "", "text": "what are the total off-balance sheet obligations , ( in millions ) ?\n\ntotal off-balance sheet obligations"}
{"_id": "q815b4e3a", "title": "", "text": "What's the increasing rate of Secured debt in 2006 Ended December 31?\n\nSecured debt"}
{"_id": "q814c11c2", "title": "", "text": "What is the sum of Investment real estate in 2012 and Gain (loss) recognized in OCI on derivatives in 2011? (in million)\n\nInvestment real estate, Gain (loss) recognized in Other Comprehensive Income, derivatives"}
{"_id": "q823c56fa", "title": "", "text": "what was the percentage change in cash provided by operating activities from 2007 to 2008?\n\ncash provided by operating activities"}
{"_id": "q83ef4f2a", "title": "", "text": "what was the percentage change in accrued warranties and related costs from 2005 to 2006?\n\naccrued warranties, related costs"}
{"_id": "q838e3f14", "title": "", "text": "as of december 31 , 2010 , what was the total committed but unused credit facilities in millions?\n\ncommitted, unused credit facilities"}
{"_id": "q83a31056", "title": "", "text": "what percentage of citi's home equity portfolio as of december 31 , 2015 was comprised of loans extended under home equity lines of credit ( revolving helocs ) ?\n\nCiti, home equity portfolio, home equity lines of credit, revolving HELOCs"}
{"_id": "q844fa212", "title": "", "text": "What's the 20 % of total elements for Carrying amount of Total in 2009? (in million)\n\nCarrying amount, Total elements"}
{"_id": "q816bd7aa", "title": "", "text": "What is the average amount of Repurchases from securitization trusts of Residential Mortgage Agency 2016, and Allowance for loan and lease losses, January 1 of 2015 ?\n\nRepurchases, securitization trusts, Residential Mortgage Agency, Allowance for loan and lease losses"}
{"_id": "q845fe974", "title": "", "text": "What is the average value of Assurant Solutions in 2015 and Cash (paid) received in 2005 for Gross Claims Liability ?\n\naverage value, Assurant Solutions, Cash received, Gross Claims Liability"}
{"_id": "q8227f58e", "title": "", "text": "what was the percentage change in the allowance for loan losses from 2007 to 2008?\n\nallowance for loan losses"}
{"_id": "q831cc906", "title": "", "text": "What is the sum of the Foreign currency forwards in the years where Interest rate caps greater than 0? (in million)\n\nForeign currency forwards, Interest rate caps"}
{"_id": "q83c6be48", "title": "", "text": "what is the highest total amount of Three months or less?\n\ntotal amount, Three months or less"}
{"_id": "q8164abd8", "title": "", "text": "What's the sum of Client deposits of Average Balance Year Ended December 31, 2013, and U.S. of As of December 31, 2012 ?\n\nClient deposits, Average Balance, U.S."}
{"_id": "q838ac280", "title": "", "text": "what was the average amounts amortized to revenue from 2010to 2014\n\naverage amounts, amortized, revenue"}
{"_id": "q857e548a", "title": "", "text": "What is the sum of Tier 1 capital of Standardized Approach for Bank of America Corporation in 2018 and Granted of Options in 2006? (in million)\n\nTier 1 capital, Standardized Approach, Bank of America Corporation, Granted Options"}
{"_id": "q819e62ec", "title": "", "text": "What is the total amount of Average shares outstanding of Year Ended December 31, 2003 2, Net sales of 2012, and TOTAL MARKET VALUE OF COMMON STOCK PER SHARE DATA of Year Ended December 31, 2002 3,4 is ?\n\naverage shares outstanding, net sales, total market value, common stock per share data"}
{"_id": "q81190e80", "title": "", "text": "What's the sum of Debt maturities of Thereafter, and Capital lease obligations of Less than 1 year ?\n\nDebt maturities, Capital lease obligations"}
{"_id": "q839fd986", "title": "", "text": "what was the cumulative lease payments to the employee who became an officer of the company following his business acquisition from 2008 to 2010\n\ncumulative lease payments, officer, business acquisition"}
{"_id": "q84e247d4", "title": "", "text": "What do all Liabilities sum up in 2011, excluding Property, plant and equipment and Inventories?\n\nLiabilities"}
{"_id": "q82356106", "title": "", "text": "What is the ratio of Attritional for Current Year to the total in 2013?\n\nAttritional, Current Year, total"}
{"_id": "q84581c94", "title": "", "text": "What was the average value of Global syndicated loans, Global long-term debt, Global equity and equity-related in 2004?\n\nGlobal syndicated loans, Global long-term debt, Global equity, equity-related"}
{"_id": "q84fab918", "title": "", "text": "in billions for the years december 2013 and december 2012 , what was total commitments to invest in funds managed by the firm?\n\ntotal commitments, invest, funds, firm"}
{"_id": "q822d5cfe", "title": "", "text": "What is the row number of the section for which the Fair Value exceeds 30 % of total Fair Value in 2011?\n\nFair Value, total Fair Value"}
{"_id": "q827065e4", "title": "", "text": "What will Goodwill reach in 2019 if it continues to grow at its current rate? (in million)\n\nGoodwill"}
{"_id": "q816dc54c", "title": "", "text": "In the year with lowest amount of Total marketing, promotion, rewards and Card Member services and other, what's the increasing rate of Card Member rewards in 2014?\n\nTotal marketing, promotion, rewards, Card Member rewards"}
{"_id": "q81b36020", "title": "", "text": "what percentage of the net inflows primarily from institutional investors was due to the transfer from retirement funds to target-date trusts?\n\nnet inflows, institutional investors, retirement funds, target-date trusts"}
{"_id": "q8140c07e", "title": "", "text": "What will Projected benefit obligation at beginning of year of Con Edison reach in 2016 if it continues to grow at its current rate? (in million)\n\nProjected benefit obligation, Con Edison"}
{"_id": "q8523400e", "title": "", "text": "What was the average of Net income (loss) for Basic earnings (loss) per share in 2008, 2007, and 2006 ?\n\nNet income, Basic earnings per share"}
{"_id": "q82b03f02", "title": "", "text": "How many years does Euro sold for U.S. dollars stay higher than Japanese yen sold for U.S. dollars?\n\nEuro, U.S. dollars, Japanese yen"}
{"_id": "q81e874cc", "title": "", "text": "in 2009 what was the gross adjustment to the unrecognized tax benefits balance based on the federal and state settlements in millions\n\ngross adjustment, unrecognized tax benefits, federal settlements, state settlements"}
{"_id": "q8190fe5e", "title": "", "text": "What will Net revenues reach in 2009 if it continues to grow at its current rate? (in thousands)\n\nNet revenues"}
{"_id": "q8267ef2c", "title": "", "text": "Between Total Coal and Nuclear Sales (MW) and Total Forward Hedged Revenues,how many elements in 2018 are lower than the previous year?\n\nTotal Coal and Nuclear Sales, Total Forward Hedged Revenues"}
{"_id": "q84e70b0c", "title": "", "text": "what was the percentage change in revenues for investments in 50% ( 50 % ) or less owned investments accounted for using the equity method between 2000 and 2001?\n\npercentage change, revenues, investments, equity method"}
{"_id": "q80ee24d6", "title": "", "text": "What will Distribution fees reach in 2010 if it continues to grow at its current rate? (in millions)\n\nDistribution fees"}
{"_id": "q856b1fc8", "title": "", "text": "in 2009 what was the ratio of the cash to securities segregated special bank accounts for the benefit of securities and futures brokerage customers\n\ncash, securities, segregated special bank accounts, futures brokerage customers"}
{"_id": "q829d983e", "title": "", "text": "What's the total amount of the Non-GAAP adjusted operating income (loss) in the years where Operating income (loss) is greater than 0? (in million)\n\nNon-GAAP adjusted operating income, Operating income"}
{"_id": "q835f1be4", "title": "", "text": "Which year is Management and financial advice fees the highest for Years Ended December 31?\n\nManagement and financial advice fees"}
{"_id": "q8262126e", "title": "", "text": "In the year with largest amount of Payments, what's the increasing rate of Marketplaces?\n\nPayments, increasing rate, Marketplaces"}
{"_id": "q8266f522", "title": "", "text": "What is the proportion of all Unaffiliated customers that are greater than 2000 to the total amount of Unaffiliated customers, in 2010? (in %)\n\nproportion, Unaffiliated customers"}
{"_id": "q84fe3854", "title": "", "text": "What is the total amount of Group retirement products of Net Investment Income, and Decrease in cash of 2010 ?\n\nGroup retirement products, Net Investment Income, Decrease in cash"}
{"_id": "q81c284ce", "title": "", "text": "What is the sum of the Time deposits in the years where Taxable greater than 0 ? (in thousand)\n\nTime deposits, Taxable"}
{"_id": "q8200a484", "title": "", "text": "How many Notional exceed the average of Notional in 2008?\n\nNotional, average"}
{"_id": "q85974f26", "title": "", "text": "What is the sum of Other comprehensive income before reclassifications for Changes related to cash flow derivative hedges in 2013 and Ship improvements in 2014?\n\nOther comprehensive income, cash flow derivative hedges, Ship improvements"}
{"_id": "q85a67226", "title": "", "text": "What is the ratio of Distribution fees to the total in 2012?\n\nDistribution fees, total"}
{"_id": "q82893600", "title": "", "text": "What is the sum of Interest cost on benefit obligation of U.S. plans for Pension plans in 2016 and Operating and maintenance in 2009? (in million)\n\nInterest cost, benefit obligation, Pension plans, Operating and maintenance"}
{"_id": "q85c994c2", "title": "", "text": "In the year with lowest amount of Other operating revenues in Table 1, what's the increasing rate of Total fair value of RSUs vested in Table 2?\n\nOther operating revenues, Total fair value, Restricted Stock Units, vested"}
{"_id": "q82a5395e", "title": "", "text": "In the section with lowest amount of Equity, what's the increasing rate of Total Revenue?\n\nEquity, increasing rate, Total Revenue"}
{"_id": "q83e33cbc", "title": "", "text": "In the year with the most Total loans in terms of Card Member loans, what is the growth rate of Average loans in terms of Card Member loans?\n\nTotal loans, Card Member loans, growth rate, Average loans"}
{"_id": "q81d96a7c", "title": "", "text": "what was the value in millions of non cash assets for the transaction in which opcity was acquired?\n\nnon cash assets, OpCity, transaction"}
{"_id": "q815ccfda", "title": "", "text": "How many Balance at Beginning of Period exceed the average of Balance at Beginning of Period in 2006?\n\nBalance at Beginning of Period, average"}
{"_id": "q8291a70e", "title": "", "text": "Which year is Interest rate swaps for Assets the most?\n\nInterest rate swaps, Assets"}
{"_id": "q859158be", "title": "", "text": "Does the value of Net income (GAAP) in 2017 greater than that in 2018?\n\nNet income, Generally Accepted Accounting Principles"}
{"_id": "q819f63ea", "title": "", "text": "what is the mathematical range for average train speed ( mph ) for 2008-2010?\n\naverage train speed"}
{"_id": "q825216e8", "title": "", "text": "what was the percentage change in net sales from 2011 to 2012?\n\npercentage change, net sales"}
{"_id": "q817e574a", "title": "", "text": "What is the average amount of Land of December 31, 2016, and Interest expense, net of Year Ended December 31, 2014 ?\n\naverage amount, Land, Interest expense"}
{"_id": "q82a101d6", "title": "", "text": "what was the percentage change in the gross profit from 2009 to 2010 \\\\n\n\ngross profit"}
{"_id": "q854c5836", "title": "", "text": "what is the highest total amount of Net sales ?\n\nNet sales"}
{"_id": "q842dcb60", "title": "", "text": "what percentage of total minimum lease payments are operating leases as of december 31 , 2006?\n\nminimum lease payments, operating leases"}
{"_id": "q81a8f77a", "title": "", "text": "What's the total amount of theU.S. dollars sold for Pounds sterling in the years where U.S. dollars sold for Pounds sterling is greater than 1?\n\nU.S. dollars, Pounds sterling"}
{"_id": "q83c8aae6", "title": "", "text": "What do all Operating leases in different period sum up without those smaller than 200000?\n\nOperating leases"}
{"_id": "q847b33be", "title": "", "text": "In terms of Carrying Value,how much of Liabilities is there in total in 2007 without Deposits and Other borrowings?\n\nCarrying Value, Liabilities, Deposits, Other borrowings"}
{"_id": "q81ac2d50", "title": "", "text": "The total amount of which section ranks first for Derivative liabilities -2? (in million)\n\ntotal amount, Derivative liabilities"}
{"_id": "q858eb974", "title": "", "text": "What is the sum of Wholesale revenues,Transmission revenues and Other revenues in 2018? (in dollars in millions)\n\nWholesale revenues, Transmission revenues, Other revenues"}
{"_id": "q853283b6", "title": "", "text": "what is the growth rate in operating profit for space systems in 2012?\n\ngrowth rate, operating profit, space systems"}
{"_id": "q8186be08", "title": "", "text": "What's the greatest value of Stores Opened in 2011?\n\nStores Opened"}
{"_id": "q85895092", "title": "", "text": "what is the percentage growth in net cash provided by operating activities from 2009 to 2010?\n\npercentage growth, net cash provided by operating activities"}
{"_id": "q81f21d9c", "title": "", "text": "what portion of the company's property is located in united states?\n\nproperty, United States"}
{"_id": "q839a8cf6", "title": "", "text": "What's the total amount of Converters, Amplifiers/Radio frequency, Other analog and Subtotal analog signal processing in 2014?\n\nConverters, Amplifiers, Radio Frequency, Analog Signal Processing"}
{"_id": "q835c7114", "title": "", "text": "what is the percentage change in total debt in 2015?\n\ntotal debt"}
{"_id": "q83385ebe", "title": "", "text": "If Noninterest expense develops with the same growth rate in 2016, what will it reach in 2017? (in million)\n\nNoninterest expense, growth rate"}
{"_id": "q814985ec", "title": "", "text": "Does the average value of total revenues in United State greater than that in Europe (a)?\n\ntotal revenues, United States, Europe"}
{"_id": "q851f21c2", "title": "", "text": "What do all Residential mortgage-backed securities sum up without those Residential mortgage-backed securities smaller than 20,000, in 2008? (in million)\n\nResidential mortgage-backed securities"}
{"_id": "q85bb6136", "title": "", "text": "what percent of 2008's total other expenses is the total customer indemnification reserve?\n\ntotal customer indemnification reserve, other expenses"}
{"_id": "q84b4101c", "title": "", "text": "what was the percentage change in the unrecognized tax benefits from 2012 to 2013?\n\nunrecognized tax benefits"}
{"_id": "q824fcc9e", "title": "", "text": "what is the total impairment charge recorded in the lat three years , in millions?\n\nimpairment charge"}
{"_id": "q831d73a6", "title": "", "text": "what was the percentage change in the expenses related to he issuing of stock option in 2009\n\npercentage change, expenses, issuing, stock option"}
{"_id": "q854f9d2a", "title": "", "text": "what was the percentage change in the additions charged to expense from 2011 to 2012 as part of the allowance for doubtful accounts\n\nadditions charged to expense, allowance for doubtful accounts"}
{"_id": "q82815ed0", "title": "", "text": "what is the estimated price of hologic common stock used in the transaction for biolucent acquisition?\n\nHologic, common stock, Biolucent acquisition"}
{"_id": "q816427ee", "title": "", "text": "Which year is the value of Income from continuing operations for As Reported higher?\n\nIncome from continuing operations, As Reported"}
{"_id": "q850271a8", "title": "", "text": "Which year is Postretirement's total Net periodic benefit cost of net periodic benefit cost the lowest?\n\nPostretirement, total, Net Periodic Benefit Cost"}
{"_id": "q824b7c3e", "title": "", "text": "what was the percentage change in revenues for investments in 50% ( 50 % ) or less owned investments accounted for using the equity method between 2001 and 2002?\n\npercentage change, revenues, investments, equity method"}
{"_id": "q8312357c", "title": "", "text": "What's the current increasing rate of Pass-through securities? (in %)\n\nPass-through securities, increasing rate"}
{"_id": "q833a573c", "title": "", "text": "what was the growth in the account balance in 2017\n\naccount balance, growth"}
{"_id": "q8220b65c", "title": "", "text": "what is the total amount amortized to revenue in the last three years , ( in millions ) ?\n\namortized to revenue"}
{"_id": "q83112876", "title": "", "text": "what is the interest expense of the loan for the first quarter?\n\ninterest expense, loan, first quarter"}
{"_id": "q8518426c", "title": "", "text": "Which year is Incurred losses and LAE the most?\n\nIncurred losses, LAE"}
{"_id": "q8177a756", "title": "", "text": "When is Number of Accounts Re-defaulted for Six Months the largest?\n\nNumber of Accounts Re-defaulted, Six Months"}
{"_id": "q8485967e", "title": "", "text": "When does sales of oil reach the largest value?\n\nsales, oil, largest value"}
{"_id": "q847740b0", "title": "", "text": "what is the percent change in free cash flow from 2015 to 2016\n\nfree cash flow"}
{"_id": "q81b5f0ec", "title": "", "text": "what is the ratio of the decrease in the retained earnings to the to the beginning amount of unrecognized tax benefits in 2007\n\nretained earnings, unrecognized tax benefits"}
{"_id": "q84892e92", "title": "", "text": "What is the total amount of Operating earnings of 2008, and FUNDED STATUS CHANGE IN PLAN ASSETS of Con Edison 2013 ?\n\nOperating earnings, Funded Status Change in Plan Assets, Con Edison"}
{"_id": "q81fc8034", "title": "", "text": "Which year is Fair Value for Aaa the highest?\n\nFair Value, Aaa"}
{"_id": "q82a22138", "title": "", "text": "In what year is Income taxes greater than 1000?\n\nIncome taxes"}
{"_id": "q82074078", "title": "", "text": "How much is the Total expenses for Corporate Benefit Funding less than the 50% of the sum of all Total expenses? (in million)\n\nTotal expenses, Corporate Benefit Funding"}
{"_id": "q823e98ca", "title": "", "text": "In which years is Other comprehensive income before reclassifications greater than Net current-period other comprehensive income (for Changes related to cash flow derivative hedges)?\n\nOther comprehensive income, net current-period other comprehensive income, cash flow derivative hedges"}
{"_id": "q81731cae", "title": "", "text": "What is the difference between the greatest Premiums earned in As previously reported in 2015 and 2014?\n\nPremiums earned"}
{"_id": "q856bb866", "title": "", "text": "In which year is U.S. dollars sold for Pounds sterling for Contract amount greater than 1?\n\nU.S. dollars, Pounds sterling, Contract amount"}
{"_id": "q82497998", "title": "", "text": "What's the average of Policy fees in 2012, 2011, and 2008?\n\nPolicy fees"}
{"_id": "q84c1b802", "title": "", "text": "What's the sum of all Components of net periodic benefit cost that are positive in 2009 for Qualified plan? (in million)\n\nComponents, net periodic benefit cost, Qualified plan"}
{"_id": "q82e92768", "title": "", "text": "What was the total amount of the KMLP and Sierrita Gas Pipeline LLC in the sections where FEP is greater than 80?\n\nKMLP, Sierrita Gas Pipeline LLC, FEP"}
{"_id": "q8271c4f2", "title": "", "text": "what is the money pool activity use of operating cash flows as a percentage of receivables from the money pool in 2003?\n\nmoney pool activity, operating cash flows, receivables"}
{"_id": "q8391f000", "title": "", "text": "what is the growth rate in the fair value of retained interests in 2018 compare to 2017?\n\ngrowth rate, fair value, retained interests"}
{"_id": "q81c5a8c0", "title": "", "text": "In the year with largest amount of U.S. Government and agency obligations, what's the sum of Qualified Plans for U.S. plans for Pension plans? (in million)\n\nU.S. Government and agency obligations, Qualified Plans, Pension plans"}
{"_id": "q825b9718", "title": "", "text": "What's the current growth rate of Purchase of minerals in-place? (in %)\n\ngrowth rate, Purchase of minerals in-place"}
{"_id": "q8178ae1c", "title": "", "text": "If Total operating revenues develops with the same increasing rate in 2011, what will it reach in 2012? (in million)\n\nTotal operating revenues"}
{"_id": "q8128f872", "title": "", "text": "What is the sum of Securities loaned in 2017 and Aggregate contractual principal in excess of fair value in 2015? (in million)\n\nSecurities loaned, Aggregate contractual principal, fair value"}
{"_id": "q80ef6abc", "title": "", "text": "What was the total amount of Amount in 2007 for Financial Services Businesses ? (in million)\n\ntotal amount, Financial Services Businesses"}
{"_id": "q8372ab1e", "title": "", "text": "What is the sum of the Unrealized gains (losses) on derivative instruments, net of income tax in the years where Net income greater than 4000?\n\nUnrealized gains, derivative instruments, net income"}
{"_id": "q82ea1bb4", "title": "", "text": "What is the difference between the greatest Stores Opened in 2011 and 2010？\n\nStores Opened"}
{"_id": "q845a7ee4", "title": "", "text": "Which year is CET1 capital greater for Basel III Standardized Transitional than 183000 ?\n\nCET1 capital, Basel III Standardized Transitional"}
{"_id": "q822f7f2a", "title": "", "text": "Which year is Total loans and leases the highest?\n\nTotal loans and leases"}
{"_id": "q8576c1f2", "title": "", "text": "What's the average of Salaries and employee benefits in 2018 and 2017?\n\nSalaries, employee benefits"}
{"_id": "q823410b2", "title": "", "text": "What was the total amount of ASSETS greater than 500000 in 2003? (in thousand)\n\ntotal amount, assets"}
{"_id": "q83462972", "title": "", "text": "What will Defined contribution plans reach in 2016 if it continues to grow at its current rate?\n\nDefined contribution plans"}
{"_id": "q843c7958", "title": "", "text": "What's the sum of Ending balance of Fiscal Year 2017, and ETBH Capital Trust XXIII—XXIV of Face Value ?\n\nEnding balance, Fiscal Year, ETBH Capital Trust, Face Value"}
{"_id": "q8125caf8", "title": "", "text": "what was the average operating leases 2014rental expense for operating leases from 2009 to 2011\n\naverage operating leases, rental expense"}
{"_id": "q82ee4676", "title": "", "text": "What is the percentage of Commercial of Gross Recoveries in relation to the total in 2014?\n\nCommercial, Gross Recoveries, total"}
{"_id": "q85d11300", "title": "", "text": "In which year is Contract valuation adjustments(d) greater than 1?\n\nContract valuation adjustments"}
{"_id": "q811e915c", "title": "", "text": "In the year with the most other revenues , what is the growth rate of General and administrative expense? (in million)\n\nGeneral and administrative expense, growth rate"}
{"_id": "q83f97dba", "title": "", "text": "Which year is As of January 1 for Number of Awards the least?\n\nNumber of Awards"}
{"_id": "q85cfd724", "title": "", "text": "What is the percentage of all elements that are positive to the total amount, for Auto & Home?\n\npercentage, positive, total amount, Auto & Home"}
{"_id": "q81251e82", "title": "", "text": "What will principal transaction be like in 2013 if it develops with the same increasing rate as current?\n\nprincipal transaction"}
{"_id": "q83a513ba", "title": "", "text": "What was the average value of Interest rate swaps, Interest rate floors, Interest rate caps for Amount in 2007? (in million)\n\naverage value, Interest Rate Swaps, Interest Rate Floors, Interest Rate Caps"}
{"_id": "q83133436", "title": "", "text": "what is the annual amortization expense related to customer relationships and network location intangibles , in millions?\n\nannual amortization expense, customer relationships, network location intangibles"}
{"_id": "q837788f0", "title": "", "text": "What is the difference between the greatest Fixed income in 2015 and 2016？ (in millions)\n\nFixed income"}
{"_id": "q85cd693a", "title": "", "text": "What do all Cash and cash equivalents sum up, excluding those negative ones in Fair Value? (in million)\n\nCash and cash equivalents, Fair Value"}
{"_id": "q8582252e", "title": "", "text": "what was the percentage increase in the allowance in doubtful accounts from 2009 to 2010\n\npercentage increase, allowance for doubtful accounts"}
{"_id": "q8398e9fa", "title": "", "text": "what is the percent of the valuation allowance to the state net operating loss carry forwards at december 312012\n\nvaluation allowance, state net operating loss carry forwards"}
{"_id": "q84cbe61a", "title": "", "text": "what is the percentage change in aggregate notional amount of outstanding foreign currency hedges from 2011 to 2012?\n\naggregate notional amount, outstanding foreign currency hedges"}
{"_id": "q83ddee88", "title": "", "text": "What is the average value of Greater than 4% of Individual Fixed Annuities in Table 0 and Cash at beginning of year in Table 2 in 2009? (in million)\n\nIndividual Fixed Annuities, Cash"}
{"_id": "q810a5124", "title": "", "text": "What's the difference of Securities America, Inc.-3(4) between 2010 and 2009 forActual Capital? (in million)\n\nSecurities America, Inc., Actual Capital"}
{"_id": "q820d0378", "title": "", "text": "as of dec 31 , 2015 , what percentage of total indebtedness was nonsecure?\n\ntotal indebtedness, nonsecure"}
{"_id": "q84ed6326", "title": "", "text": "If Goodwill develops with the same increasing rate in2016, what will it reach in 2017? (in million)\n\nGoodwill"}
{"_id": "q83bdabd2", "title": "", "text": "What was the total amount of Net revenues in 2015 and 2016?\n\nNet revenues"}
{"_id": "q81eef32e", "title": "", "text": "In the year with lowest amount of Other analog, what's the increasing rate of Converters?\n\nOther analog, increasing rate, Converters"}
{"_id": "q82acb2ba", "title": "", "text": "In the level with largest amount of U.S. Treasuries of Fixed Income Securities, what's the sum of Fixed Income Securities?\n\nU.S. Treasuries, Fixed Income Securities, sum"}
{"_id": "q84644d66", "title": "", "text": "What's the total amount of Income tax expense in 2016? (in dollars in millions)\n\nIncome tax expense"}
{"_id": "q81f6d2e2", "title": "", "text": "Which year is Management and financial advice fees the highest?\n\nManagement and financial advice fees"}
{"_id": "q83eb26ca", "title": "", "text": "What's the 30 % of total Fair Value in 2011?\n\nFair Value"}
{"_id": "q84da3364", "title": "", "text": "If Total revenue develops with the same increasing rate in 2013, what will it reach in 2014? (in millions)\n\nTotal revenue"}
{"_id": "q81ae8f8c", "title": "", "text": "what was the ratio of the decreases in the net sales to the operating profit for mst from 2010 to 2011\n\nnet sales, operating profit, MST"}
{"_id": "q8145201a", "title": "", "text": "what's the total amount of No surrender charge of 2010 Individual Fixed Annuities, Change in cash of 2008, and Total reserves of 2010 Individual Variable Annuities ?\n\nNo surrender charge, Individual Fixed Annuities, Total reserves, Individual Variable Annuities"}
{"_id": "q84d648f8", "title": "", "text": "What's the total amount of Swaps, Futures and forwards, Written options and Purchased options in terms of interest rate contracts with Contract/ Notional in 2005? (in dollars in millions)\n\nSwaps, Futures, forwards, Written options, Purchased options, interest rate contracts, Contract/Notional"}
{"_id": "q848b3818", "title": "", "text": "What's the difference of Policy fees between 2015 and 2014? (in millions)\n\nPolicy fees"}
{"_id": "q83510c84", "title": "", "text": "What is the sum of Asset-backed in 2016? (in million)\n\nAsset-backed"}
{"_id": "q81825962", "title": "", "text": "What is the percentage of Consumer in relation to the total in 2008 ? (in %)\n\nConsumer, total"}
{"_id": "q827db0d2", "title": "", "text": "What do all Number of shares sum up, excluding those negative ones in 2012 ?\n\nnumber of shares"}
{"_id": "q858a1a5e", "title": "", "text": "during 2016 what was the average price paid for the shares repurchased by the company?\n\naverage price, shares repurchased"}
{"_id": "q84ada312", "title": "", "text": "what was the change in asset retirement obligations between 2002 and 2003?\\\\n\n\nasset retirement obligations"}
{"_id": "q812c0b0c", "title": "", "text": "What will Total trading account assets be like in 2011 if it continues to grow at the same rate as it did in 2010? (in million)\n\nTotal trading account assets"}
{"_id": "q8344f5de", "title": "", "text": "In the year with largest amount of Net income, what's the sum ofNet income and Depreciation and amortization? (in thousands)\n\nNet income, Depreciation, amortization"}
{"_id": "q84f0138c", "title": "", "text": "What is the difference between North America and EMEA 's highest Total change (U.S. GAAP)? (in million)\n\nNorth America, EMEA, Total change, U.S. GAAP"}
{"_id": "q81316fac", "title": "", "text": "as of december 31 , 2017 , what was the percent of the 2016 program remaining available for purchase\n\n2016 program, percent, remaining available for purchase"}
{"_id": "q8596969e", "title": "", "text": "What's the average of Share repurchase program in October, 2013?\n\nShare repurchase program"}
{"_id": "q81e68536", "title": "", "text": "How many elements show private value in 2014 for Amortized Cost?\n\nprivate value, Amortized Cost"}
{"_id": "q81c79824", "title": "", "text": "What's the sum of Share repurchase program in the range of 1000000 and 2000000 in October, 2013?\n\nShare repurchase program"}
{"_id": "q81fd9366", "title": "", "text": "What is the growing rate of Canada-1 in the year with the most Total calendar year effect ?\n\nCanada-1, Total calendar year effect, growing rate"}
{"_id": "q84dc5c34", "title": "", "text": "What's the total amount of the Revenues, net of interest expense in the years where Revenues, net of interest expense greater than 80000? (in million)\n\nRevenues, net of interest expense"}
{"_id": "q812ed2d8", "title": "", "text": "Which element exceeds 30 % of total for Total transaction and integration charges in 2010?\n\nTotal transaction and integration charges"}
{"_id": "q857cef82", "title": "", "text": "what is the highest total amount of Total available-for-sale securities? (in million)\n\nTotal available-for-sale securities"}
{"_id": "q8126ce80", "title": "", "text": "what is the highest total amount of North Sea?\n\nNorth Sea, total amount"}
{"_id": "q844dbad8", "title": "", "text": "what is the growth rate in revenue related technology and risk management from 2015 to 2016?\n\ngrowth rate, revenue, technology, risk management"}
{"_id": "q84845660", "title": "", "text": "what was the percentage decline in pipeline barrels from 2007 to 2009?\n\npercentage decline, pipeline barrels"}
{"_id": "q82287360", "title": "", "text": "What's the sum of Decreases in current period tax positions, and Net sales of Year Ended December 31, 2014 ?\n\nDecreases in current period tax positions, Net sales"}
{"_id": "q829bcdd8", "title": "", "text": "In the year with lowest amount of Deposits with banks Average volume, what's the increasing rate of Deposits with banks Average volume?\n\nDeposits with banks, Average volume, increasing rate"}
{"_id": "q81f93208", "title": "", "text": "What is the sum of Total gross recoveries in 2012 and Fixed annuity in 2006? (in million)\n\nTotal gross recoveries, Fixed annuity"}
{"_id": "q811517ee", "title": "", "text": "What is the growth rate of Balance between December 31, 2008 and December 31, 2009?\n\ngrowth rate, Balance"}
{"_id": "q8265da70", "title": "", "text": "What's the current growth rate of Purchase of minerals in-place?\n\ngrowth rate, Purchase of minerals in-place"}
{"_id": "q81f4d938", "title": "", "text": "What is the sum of Balance at December 31, 2007-1 in 2007? (in million)\n\nBalance, sum"}
{"_id": "q82eb0f9c", "title": "", "text": "In which section the sum of Aircraft on Firm Order has the highest value?\n\nAircraft on Firm Order"}
{"_id": "q81aa19b6", "title": "", "text": "What is the average amount of Paid losses of At December 31, 2016, and Vested of Years Ended December 31, 2016 Shares ?\n\naverage amount, paid losses, vested, shares"}
{"_id": "q845b385c", "title": "", "text": "In the year with largest amount of Pension Fundings, what's the sum of Commitment Type?\n\nPension Fundings, Commitment Type"}
{"_id": "q8539a24a", "title": "", "text": "What is the average growth rate of U.S. high-grade between 2003 and 2004?\n\naverage growth rate, U.S., high-grade"}
{"_id": "q8586ac20", "title": "", "text": "In the year with largest amount of Company, what's the sum of Bank ? (in thousand)\n\nCompany, sum, Bank"}
{"_id": "q84f51a8a", "title": "", "text": "What is the total value of Premium ,Total revenue ,Policy benefits and Required interest on net reserves in Life?\n\nPremium, Total revenue, Policy benefits, Required interest on net reserves"}
{"_id": "q85984980", "title": "", "text": "What is the total amount of Commercial real estate of December 31 2008 Amount, and Assets in custody of December 31 2009 ?\n\nCommercial real estate, Assets in custody"}
{"_id": "q8328ed6c", "title": "", "text": "What is the growing rate of Net investment income in the year with the most Distribution fees?\n\nNet investment income, Distribution fees"}
{"_id": "q83f8afde", "title": "", "text": "What is the total amount of Other assets, including investment in TradeHelm, and Compensation expense of Year Ended December 31, 2005 ?\n\nOther assets, TradeHelm, Compensation expense"}
{"_id": "q82a009b6", "title": "", "text": "as a result of the sales of certain non-core towers and other assets what was the percent of the change in the recorded net losses from 2007 to 2008\n\nnon-core towers, net losses"}
{"_id": "q81ee3fa6", "title": "", "text": "what percentage where north american consumer packaging net sales of total consumer packaging sales in 2012?\n\nNorth American Consumer Packaging, net sales, total Consumer Packaging sales"}
{"_id": "q8184fb22", "title": "", "text": "what was the average share price that the shares were repurchased in 2011?\n\naverage share price, shares repurchased"}
{"_id": "q85ca9516", "title": "", "text": "What's the growth rate of Office for Nonperforming Loans andForeclosed Properties-1 in 2011?\n\ngrowth rate, Office for Nonperforming Loans, Foreclosed Properties"}
{"_id": "q846cc1ee", "title": "", "text": "what was the average revenue from discontinued operations in 2013 and 2011 , in millions?\n\naverage revenue, discontinued operations"}
{"_id": "q818187da", "title": "", "text": "What is the total value of Operating income, Other investment income/(losses), Equity in earnings of unconsolidated affiliates and Interest and dividend income for before consolidation ? (in million)\n\nOperating income, Other investment income, Equity in earnings, Interest and dividend income"}
{"_id": "q84370e1e", "title": "", "text": "What is the proportion of Net Charge-offs Office to the total in 2011?\n\nNet Charge-offs Office, total"}
{"_id": "q811dbf2a", "title": "", "text": "What do all collateralized financings sum up in 2018 , excluding Repurchase agreements and Securities loaned? (in million)\n\ncollateralized financings, Repurchase agreements, Securities loaned"}
{"_id": "q83ac8384", "title": "", "text": "What is the sum of Registered investment companies in the range of0 and 20 in 2018?\n\nRegistered Investment Companies"}
{"_id": "q84ce42de", "title": "", "text": "what is the mathematical range of deferred acquisition payments from 2018-2022 , in millions?\n\ndeferred acquisition payments"}
{"_id": "q854769d4", "title": "", "text": "Which Year Ended December 31 is the Amount of Gross investment income before investment expenses the most?\n\nGross investment income, investment expenses"}
{"_id": "q8201b8d8", "title": "", "text": "What was the average of Finance — Finance Companies for Amortized cost Gross unrealized gains Gross unrealized losses (in million)\n\nFinance Companies, Amortized cost, Gross unrealized gains, Gross unrealized losses"}
{"_id": "q831acf48", "title": "", "text": "What will Commercial – foreign reach in 2010 if it continues to grow at its current rate? (in millions)\n\nCommercial, foreign reach"}
{"_id": "q8205e688", "title": "", "text": "What was the average value of the Cost of goods sold in the years where External net sales is positive?\n\naverage value, Cost of Goods Sold, External Net Sales"}
{"_id": "q82b41e56", "title": "", "text": "What's the average of Capital leases of Carrying amount in 2003 and 2002? (in Thousand)\n\nCapital leases, carrying amount"}
{"_id": "q84cff2f0", "title": "", "text": "what was the percentage change in non-cash stock-based compensation expense from 2013 to 2014?\n\nnon-cash stock-based compensation expense"}
{"_id": "q85b9e5b8", "title": "", "text": "What is the amount gap between FES and OE in terms of Expenses on Support services? (in million)\n\nFES, OE, Expenses, Support services"}
{"_id": "q82ff7716", "title": "", "text": "for the blackrock common stock equivalent shares at december 31 , 2015 , accounted for under the equity method , what was the cost per share in dollars?\n\nBlackRock, common stock equivalent shares, equity method, cost per share"}
{"_id": "q83e22426", "title": "", "text": "In which year is Other comprehensive income before reclassifications for Changes related to cash flow derivative hedges positive?\n\nOther comprehensive income, cash flow derivative hedges"}
{"_id": "q83b1443c", "title": "", "text": "What is the total amount of Exercisable at beginning of year of Shares, and Other income of Percentage Change 2013 ?\n\nExercisable Shares, Other income, Percentage Change"}
{"_id": "q8314b324", "title": "", "text": "In terms of Assets,which year is Fair Values of Total derivatives designated as hedging instruments on December 31 higher?\n\nFair Values, Total derivatives, hedging instruments"}
{"_id": "q85940ec4", "title": "", "text": "What's the average of Structured notes and Total long-term unsecured funding in 2016? (in million)\n\nStructured notes, Total long-term unsecured funding"}
{"_id": "q853a6126", "title": "", "text": "In the section with largest amount of Fixed maturities, what's the sum of Policy loans and Swaps ? (in million)\n\nFixed maturities, Policy loans, Swaps"}
{"_id": "q835915aa", "title": "", "text": "What was the average value of Service cost, Interest cost, Employer contributions in 2015 for Pension Benefits? (in million)\n\nService cost, Interest cost, Employer contributions, Pension Benefits"}
{"_id": "q81232230", "title": "", "text": "what was the percentage change in cash from operations between 2008 and 2009?\n\ncash from operations"}
{"_id": "q83a6f7b6", "title": "", "text": "What's the total amount of the Policyholders’ account balances - investment contracts in the years where Policy loans of Assets greater than 0 for Fair Value? (in million)\n\nPolicyholders’ account balances, investment contracts, Policy loans, Fair Value"}
{"_id": "q816357f6", "title": "", "text": "What's the total amount of Rental and management in 2010? (in thousand)\n\nRental and management"}
{"_id": "q85ba959e", "title": "", "text": "What is the sum of Interest rate and Foreign exchange in 2005 for Notional amounts(a? (in billion)\n\nInterest rate, Foreign exchange, Notional amounts"}
{"_id": "q81332f22", "title": "", "text": "In the year with the most Total fixed rate debt, what is the amount of Variable rate debt and total?\n\nTotal fixed rate debt, Variable rate debt, total"}
{"_id": "q8396ee3e", "title": "", "text": "what is the percentage decrease in total liability from dec 31 2007 to dec 31 2008?\n\npercentage decrease, total liability"}
{"_id": "q85b816b6", "title": "", "text": "What's the total amount of the Total revenues in the years where Net realized capital gains (losses) is greater than -716?\n\nTotal revenues, Net realized capital gains, losses"}
{"_id": "q83d15722", "title": "", "text": "What is the sum of the Total operating expenses in the sections where Total operating revenues is positive? (in million)\n\nTotal operating expenses, Total operating revenues"}
{"_id": "q81c91bd6", "title": "", "text": "What is the ratio of the Secured debt to the Total debt in 2005 Ended December 31?\n\nSecured debt, Total debt"}
{"_id": "q83ff4a60", "title": "", "text": "How many element exceed the average of Interest expense in 2009\n\ninterest expense"}
{"_id": "q84f1161a", "title": "", "text": "What is the sum of Noninterest expense in 2016? (in million)\n\nNoninterest expense"}
{"_id": "q84d48068", "title": "", "text": "What was the average of the Fixed-rate in the years where Total Commercial Banking is positive? (in million)\n\naverage, Fixed-rate, Total Commercial Banking"}
{"_id": "q81afd040", "title": "", "text": "What's the sum of Operating profit of 2012, and Net income of Year Ended December 31, 2002 3,4 is ?\n\nOperating profit, Net income"}
{"_id": "q858184ca", "title": "", "text": "In the year with largest amount of Institutional of Non-U.S. , what's the sum of loans and lease\n\nInstitutional Non-U.S., loans, lease"}
{"_id": "q8316fc06", "title": "", "text": "How many kinds of Sales volume are greater than 200 in 2017?\n\nSales volume"}
{"_id": "q827cc5dc", "title": "", "text": "what was the percentage change in non-cash stock-based compensation expense from 2012 to 2013?\n\nnon-cash stock-based compensation expense"}
{"_id": "q81bcfd1a", "title": "", "text": "What is the sum of the Professional and consulting fees for Amount in the years where Depreciation and amortization is positive for Amount? (in thousand)\n\nProfessional fees, consulting fees, Depreciation, amortization"}
{"_id": "q81e57b96", "title": "", "text": "What is the average amount of Balance at December 31, 2012, and Net sales of Year Ended December 31, 2014 ?\n\nBalance, Net sales"}
{"_id": "q835a4894", "title": "", "text": "In the year with largest value of sales of oil, what's the sum of sales of gas? (in million)\n\nsales of oil, sales of gas"}
{"_id": "q8170c918", "title": "", "text": "What will Interest Income reach in 2008 if it continues to grow at its current rate?\n\nInterest Income"}
{"_id": "q85777200", "title": "", "text": "What is the sum of the Held-for-sale in the sections where Held-for-investment is positive? (in million)\n\nHeld-for-sale, Held-for-investment"}
{"_id": "q822c51ec", "title": "", "text": "If Investment Bank for Total develops with the same increasing rate in 2009, what will it reach in 2010? (in million)\n\nInvestment Bank, Total"}
{"_id": "q85003dde", "title": "", "text": "What is the sum of International Consumer and Network Services of 2016, U.S. Consumer Services of 2017, and Card Member receivables of 2016 ?\n\nInternational Consumer and Network Services, U.S. Consumer Services, Card Member receivables"}
{"_id": "q8433e9a0", "title": "", "text": "What's the average of the Solid Waste in the years where Amortization of landfill airspace is positive?\n\nSolid Waste, Amortization, landfill airspace"}
{"_id": "q829ed85c", "title": "", "text": "What's the average of Provision for credit losses and Gains on sales of debt securities of Restated in 2005? (in million)\n\nProvision for credit losses, Gains on sales of debt securities"}
{"_id": "q82432d04", "title": "", "text": "Which year is Change, net of taxes the most?\n\nChange, net of taxes"}
{"_id": "q820b0bcc", "title": "", "text": "In the section with largest amount of net cash provided by operating activities of continuing operations, what's the sum of proceeds from maturities of investments? (in million)\n\nnet cash provided by operating activities, continuing operations, proceeds, maturities of investments"}
{"_id": "q82d6a034", "title": "", "text": "What's the growth rate of Total trading account assets in 2010?\n\ngrowth rate, Total trading account assets"}
{"_id": "q8348fc4c", "title": "", "text": "What was the sum of total electric retail without those total electric retail smaller than 2000( in 2018)? (in thousand)\n\ntotal electric retail"}
{"_id": "q83100f7c", "title": "", "text": "brazilian paper sales represented what percentage of printing papers in 2005?\n\nBrazilian paper sales, printing papers"}
{"_id": "q828c1afa", "title": "", "text": "What is the ratio of all elements that are in the range of 1000 and 3000 to the sum of elements, for Fair of Total?\n\nratio, elements, Fair of Total"}
{"_id": "q8157d8d6", "title": "", "text": "What was the total amount of Volume – Units excluding those Volume – Units greater than 1000 inEMEA Latin America\n\ntotal amount, Volume – Units, EMEA, Latin America"}
{"_id": "q85b90684", "title": "", "text": "What is the growing rate of hombuilding in the year with the most financial services?\n\nhomebuilding, financial services"}
{"_id": "q813cd09a", "title": "", "text": "In the section with the most Liquid hydrocarbons(mmbbl), what is the growth rate of Natural gas(bcf)?\n\nLiquid hydrocarbons, growth rate, Natural gas"}
{"_id": "q82441796", "title": "", "text": "what was the decrease observed in the fair market value of plan assets of the benefit pension plans during 2014 and 2015?\n\nfair market value, plan assets, benefit pension plans"}
{"_id": "q819d229c", "title": "", "text": "What is the column number of the section where the BALANCE, JANUARY 1, 2007 is negative?\n\nBALANCE, JANUARY 1"}
{"_id": "q85bc44e8", "title": "", "text": "What's the growth rate of Swaps in terms of Interest rate contracts with Contract/ Notional in 2005?\n\ngrowth rate, Swaps, Interest Rate Contracts, Contract/Notional"}
{"_id": "q85709e08", "title": "", "text": "What is the average amount of Weighted average partnership Units outstanding of 2007, and 2022 of Industrial SquareFeet 8,028 12,303 13,525 12,567 13,042 ?\n\nWeighted average partnership units, Industrial SquareFeet"}
{"_id": "q84805b5a", "title": "", "text": "What is the total value of Labor and related benefitsTransfer and disposal costs Maintenance and repairs Subcontractor costs in 2013?\n\nLabor and related benefits, transfer and disposal costs, maintenance and repairs, subcontractor costs"}
{"_id": "q83fa38cc", "title": "", "text": "What's the growth rate of Group specialty in 2011? (in %)\n\ngrowth rate, Group Specialty"}
{"_id": "q833b4156", "title": "", "text": "What do all total non-interest income sum up, excluding those negative ones in 2012 ?\n\ntotal non-interest income"}
{"_id": "q8399f3a4", "title": "", "text": "Which year is Total loans in terms of Card Member loans the most?\n\nTotal loans, Card Member loans"}
{"_id": "q83b376e4", "title": "", "text": "what was the change in the weighted average interest rate earned by the company on its cash , cash equivalents , and short-term investments between 2007 and 2006?\n\nweighted average interest rate, cash, cash equivalents, short-term investments"}
{"_id": "q8504d8bc", "title": "", "text": "what was the percent of the increase the additions for new sales of the repurchase reserve from 2008 to 2009\n\npercent, increase, additions, repurchase reserve"}
{"_id": "q82e2ab22", "title": "", "text": "What was the total amount of Total asset-backed the in the sections where Corporate and other bonds is greater than 100? (in million)\n\ntotal asset-backed, Corporate bonds"}
{"_id": "q829908be", "title": "", "text": "What will GAAP of Operating Income be like in 2017 if it develops with the same increasing rate as current?\n\nGAAP, Operating Income"}
{"_id": "q83669e0a", "title": "", "text": "What is the sum of the Average annual rent per square foot-2 of Life science in the years where Average annual rent per unit-2 of Senior housing-1 is positive?\n\nAverage annual rent, Life science, Senior housing"}
{"_id": "q83dd4992", "title": "", "text": "what is the approximately number of vehicles that were converted to compressed natural gas\n\nvehicles, compressed natural gas"}
{"_id": "q830bca48", "title": "", "text": "In the year with the most Premiums in GAAP in table 1, what is the growth rate of Net investment income in GAAP in table 1?\n\nPremiums, growth rate, Net Investment Income, GAAP"}
{"_id": "q859a1ed6", "title": "", "text": "What was the average value of the Home equity for Allowance in the years where Commercial for Allowance is positive? (in million)\n\naverage value, Home equity, Allowance, Commercial"}
{"_id": "q810cc3b4", "title": "", "text": "In the year / section with largest amount of Average contract revenue per MWh, what's the sum of Planned net MW in operation?\n\nAverage contract revenue, Planned net MW, operation"}
{"_id": "q8402e2e2", "title": "", "text": "What's the average of Cash and cash equivalents and Goodwill and intangible assets, net and Borrowings in 2017? (in dollars in millions)\n\nCash and cash equivalents, Goodwill and intangible assets, Borrowings"}
{"_id": "q858cbd4a", "title": "", "text": "In the year with lowest amount of Total segment the lowest for Total Incurred, what's the increasing rate of Catastrophes for Total Incurred?\n\nTotal segment, Total Incurred, Catastrophes, increasing rate"}
{"_id": "q83bf4b36", "title": "", "text": "What will Andes SBU be like in 2015 if it continues to grow at the same rate as it did in 2014? (in million)\n\nAndes SBU, growth rate"}
{"_id": "q812de33c", "title": "", "text": "Does TRICARE subtotal keeps increasing each year between 2003 and 2004 ?\n\nTRICARE, subtotal"}
{"_id": "q85831240", "title": "", "text": "by what percentage did the amount of claims as of sept 30 , 2007 decrease to equal the combined claims september 30 of 2009-2012?\n\npercentage, claims, combined claims"}
{"_id": "q851a0e26", "title": "", "text": "What is the total amount of Capital lease obligations of Less than 1 year, and Gross written premiums of Years Ended December 31, 2012 ?\n\nCapital lease obligations, Gross written premiums"}
{"_id": "q8375b8cc", "title": "", "text": "In which year is Net realized capital gains (losses) income positive?\n\nNet realized capital gains, income"}
{"_id": "q832c4dfe", "title": "", "text": "by what percentage did adjustments to valuation allowances increase from 2011 to 2012>\n\nadjustments, valuation allowances"}
{"_id": "q812a0c08", "title": "", "text": "What is the average increasing rate of Purchased power between 2017 and 2018? (in million)\n\naverage increasing rate, Purchased Power"}
{"_id": "q84a5d830", "title": "", "text": "What was the total amount of the Camarillo Oaks and Bonita Cedars in the sections where Anavia is greater than 312000?\n\nCamarillo Oaks, Bonita Cedars, Anavia"}
{"_id": "q82d2c518", "title": "", "text": "Which year is Fixed maturities, available-for-sale for Carrying amount the most?\n\nFixed maturities, available-for-sale, Carrying amount"}
{"_id": "q85461e58", "title": "", "text": "In the year with the mostGross written premiums what is the growth rate of Premiums earned?\n\nGross written premiums, growth rate, Premiums earned"}
{"_id": "q82a93a40", "title": "", "text": "What was the total amount of assets for Assumed in 2014? (in million)\n\ntotal amount of assets, Assumed"}
{"_id": "q850114b6", "title": "", "text": "what is the growth rate in based rent for hudson yards , new york facility in the third period?\n\ngrowth rate, base rent, Hudson Yards, New York facility"}
{"_id": "q82200a7c", "title": "", "text": "What is the growing rate of Other revenues in the year with the most Transmission revenues?\n\ngrowing rate, Other revenues, Transmission revenues"}
{"_id": "q85c747d0", "title": "", "text": "What is the sum of Incurred losses of At December 31, 2017, and Vested of Years Ended December 31, 2016 Shares ?\n\nIncurred losses, Vested, Shares"}
{"_id": "q8483968a", "title": "", "text": "In the year with largest amount of Proceeds, what's the increasing rate of Gross investment gains in Fixed Maturity Securities ?\n\nProceeds, increasing rate, Gross investment gains, Fixed Maturity Securities"}
{"_id": "q836f2ebc", "title": "", "text": "What was the total amount of elements for December 31 in the range of 2000 and 3000 in 2010? (in million)\n\ntotal amount, elements"}
{"_id": "q8193210c", "title": "", "text": "what was the percentage change in net cash provided by operating activities from 2016 to 2017?\n\npercentage change, net cash provided by operating activities"}
{"_id": "q8361d06e", "title": "", "text": "What's the sum of Premium wine of December 31, 2014, and Beginning Balance of Year Ended December 31, 2015 ?\n\nPremium wine, Beginning Balance"}
{"_id": "q84c06a10", "title": "", "text": "What is the average amount of Acquisition payments of After 5 Years, and Software and IT maintenance expenses of 2017 ?\n\nAcquisition payments, Software, IT maintenance expenses"}
{"_id": "q8321712c", "title": "", "text": "based on the review of the changes in the warranty reserve what was the percentage change in the year end balance in 2009\n\nwarranty reserve, percentage change, year end balance"}
{"_id": "q84eaab0e", "title": "", "text": "what is the growth rate in net revenue in 2004 for entergy corporation?\n\ngrowth rate, net revenue, Entergy Corporation"}
{"_id": "q828823aa", "title": "", "text": "what's the total amount of Accumulated benefit obligation CHANGE IN PLAN ASSETS of CECONY 2013, and Operating earnings of 2008 ?\n\nAccumulated Benefit Obligation, Change in Plan Assets, CECONY, Operating Earnings"}
{"_id": "q8115b172", "title": "", "text": "what is the pre-tax aggregate net unrealized loss in 2008?\n\npre-tax aggregate net unrealized loss"}
{"_id": "q8584d3c8", "title": "", "text": "In the year with largest amount of Commercial of Gross Recoveries, what's the increasing rate of Total gross recoveries?\n\nCommercial Gross Recoveries, Total gross recoveries"}
{"_id": "q847157e0", "title": "", "text": "considering the class a common stocks , what is the percentage's increase of the number issued to participating employees in relation non-executive directors amidst 2016 and 2017?\n\nClass A common stocks, percentage increase, participating employees, non-executive directors"}
{"_id": "q82bd9cf6", "title": "", "text": "In what year is Net investment gains (losses) positive?\n\nNet investment gains (losses)"}
{"_id": "q8204fa8e", "title": "", "text": "In the year with the most Management and financial advice fees, what is the growth rate of Management and financial advice fees?\n\nManagement and financial advice fees, growth rate"}
{"_id": "q84911440", "title": "", "text": "How many element continues to increase every year from 2008 to 2009 in Loan losses?\n\nLoan losses"}
{"_id": "q85741ea2", "title": "", "text": "In what year is Electric utility operations greater than 1?\n\nElectric utility operations"}
{"_id": "q84ff0cfc", "title": "", "text": "How many U.S. Plans exceed the average of U.S. Plans in 2016 for Pension?\n\nU.S. Plans, Pension"}
{"_id": "q84f3c928", "title": "", "text": "In what year is Net occupancy greater than 18000?\n\nNet occupancy"}
{"_id": "q847d465e", "title": "", "text": "what percentage of total maturities of debt come due prior to 2019?\n\ntotal maturities, debt"}
{"_id": "q852067b2", "title": "", "text": "What's the total amount of the elements in the years where Corporate is greater than 70000?\n\ntotal amount, Corporate"}
{"_id": "q8253617e", "title": "", "text": "what is the ratio of securities remaining to securities issued?\n\nsecurities remaining, securities issued"}
{"_id": "q8588b970", "title": "", "text": "how much square feet could the company use to build properies ? ( 1 acre = 43560 square feet )\n\nsquare feet, properties"}
{"_id": "q838c551e", "title": "", "text": "What's the 30% of total for Total transaction and integration charges in 2010? (in million)\n\nTotal transaction and integration charges"}
{"_id": "q82d1dfae", "title": "", "text": "What's the average of the Restricted stock units in the years where Junior subordinated notes due 2066 for Outstanding Balance December 31, is positive? (in million)\n\naverage, Restricted Stock Units, Junior Subordinated Notes, Outstanding Balance"}
{"_id": "q81537282", "title": "", "text": "When does Premiums earned in As previously reported reach the largest value?\n\nPremiums earned, largest value"}
{"_id": "q84b273ec", "title": "", "text": "What's the sum of the equity the securities in the level where U.S. small cap stocks is greater than 1? (in million)\n\nequity, securities, U.S. small cap stocks"}
{"_id": "q8529958a", "title": "", "text": "What is the average amount of Ship improvements of 2015, and Other comprehensive income before reclassifications of Changes in definedbenefit plans ?\n\nShip improvements, Other comprehensive income, Changes in defined benefit plans"}
{"_id": "q85c1e02e", "title": "", "text": "What is the increasing rate of Payments due by period for Capital lease obligations between due by period 2017 and due by period 2018?\n\nPayments, Capital lease obligations"}
{"_id": "q8136eb08", "title": "", "text": "What is the total amount of Net cash used in financing activities of 2010, Individual fixed annuities of Net Investment Income, and Group retirement products of Total Revenues ?\n\nNet cash used in financing activities, Individual fixed annuities, Group retirement products, Total Revenues"}
{"_id": "q8145f058", "title": "", "text": "what was the percent of the decline in the gross unrecognized tax benefits from 2009 to 2010\n\ngross unrecognized tax benefits"}
{"_id": "q85a05e90", "title": "", "text": "In the year with largest amount of Collection: Residential, what's the increasing rate of Total Collection of Collection?\n\nCollection, Residential, Total Collection, increasing rate"}
{"_id": "q8120e178", "title": "", "text": "What was the total amount of Net interest revenue and Non-interest revenue in 2009 ? (in million)\n\nNet interest revenue, Non-interest revenue"}
{"_id": "q83e8e32e", "title": "", "text": "In the section with largest amount of Operating revenues, what's the sum of elements? (in Thousand)\n\nOperating revenues, sum, elements"}
{"_id": "q839effac", "title": "", "text": "What is the average growth rate of Production expenses, including related taxes between 2011 and 2012 ?\n\naverage growth rate, Production expenses, related taxes"}
{"_id": "q84bdf1d6", "title": "", "text": "In the year with largest amount of Services, what's the increasing rate of Hardware ?\n\nServices, increasing rate, Hardware"}
{"_id": "q81eaafa8", "title": "", "text": "What is the percentage of all Shares that are positive to the total amount, in 2017?\n\npercentage, Shares, total amount"}
{"_id": "q85372790", "title": "", "text": "What is the sum of corporateand in the range of 6000 in 2015? (in million)\n\nsum, corporate, range"}
{"_id": "q84c3c372", "title": "", "text": "What is the sum of Net written premiums for Specialty and Other revenue, primarily operating in 2016?\n\nNet written premiums, Specialty, Other revenue"}
{"_id": "q826cd24e", "title": "", "text": "What is the sum of Noninterest income in 2010 and Interest payments-7 of Thereafter for Payments due by? (in million)\n\nNoninterest income, Interest payments"}
{"_id": "q82699dea", "title": "", "text": "What's the total value of all elements that are in the range of 1000 and 3000 for Fair of Total?\n\nFair of Total, total value"}
{"_id": "q8326c244", "title": "", "text": "How many Trading securities debt exceed the average of Trading securities debt in 2009?\n\nTrading securities debt"}
{"_id": "q818fa568", "title": "", "text": "What was the total amount of the Additions to customer relationship and acquisition costs in the sections where Cash Flows from Operating Activities greater than 0?\n\nAdditions, customer relationship, acquisition costs, Cash Flows from Operating Activities"}
{"_id": "q82ab7daa", "title": "", "text": "what was the percentage cumulative total shareholder return on disca for the five year period ended december 31 , 2018?\n\npercentage cumulative total shareholder return, Discovery Inc."}
{"_id": "q85880192", "title": "", "text": "In which year is Sales volume by product tons (000s) positive?\n\nSales volume, product tons"}
{"_id": "q816ca8b0", "title": "", "text": "what percentage of employees are subject to collective bargaining agreements?\n\npercentage, employees, collective bargaining agreements"}
{"_id": "q83e9e292", "title": "", "text": "In the year with largest amount of Management and financial advice fees, what's the sum of Management and financial advice fees and Distribution fees? (in million)\n\nManagement and financial advice fees, Distribution fees"}
{"_id": "q835220e2", "title": "", "text": "What do all Notional sum up, excluding those negative ones in 2008 for As of December 31, 2008 for Financial assets with interest rate risk? (in million)\n\nNotional, Financial assets, interest rate risk"}
{"_id": "q84ba27ea", "title": "", "text": "What's the average of the Total deferred tax liabilities in the years where Long-term deferred income taxes is greater than 0? (in thousand)\n\nTotal deferred tax liabilities, Long-term deferred income taxes"}
{"_id": "q82c1c808", "title": "", "text": "What is the sum of Income taxes in 2008 and Municipal investments for LoanCommitments? (in million)\n\nIncome taxes, Municipal investments, Loan Commitments"}
{"_id": "q83a0fcf8", "title": "", "text": "In what sections is Finance — Finance Companies positive?\n\nFinance, Finance Companies, positive"}
{"_id": "q815113e8", "title": "", "text": "What was the total amount of elements for RevPAR excluding those elements greater than 150 in 2016 ?\n\nRevPAR, total amount, elements"}
{"_id": "q8231b952", "title": "", "text": "What will Secured debt be like in 2007 Ended December 31 if it develops with the same increasing rate as in 2006 Ended December 31? (in thousand)\n\nSecured debt, increasing rate"}
{"_id": "q8393b9bc", "title": "", "text": "If Net income of the Fourth Quarter develops with the same growth rate in 2016, what will it reach in 2017? (in dollars in millions)\n\nNet income, Fourth Quarter, growth rate"}
{"_id": "q840174b6", "title": "", "text": "What is the total value of Subprime, Non-U.S. Residential,Securities and Loans in 2009 for Gross ? (in million)\n\nSubprime, Non-U.S. Residential, Securities, Loans"}
{"_id": "q81d5b544", "title": "", "text": "What's the total amount of the Diluted: Weighted-average common shares outstanding for Denominator in the years where Total revenues for Revenues is greater than 0? (in million)\n\nDiluted, Weighted-average common shares outstanding, Total revenues"}
{"_id": "q84e3361c", "title": "", "text": "What's the total amount of the Curtailments in the years where Settlements is greater than 30? (in million)\n\nCurtailments, Settlements"}
{"_id": "q81ce41f6", "title": "", "text": "What was the average amount of Total stock-based compensation for Three Months Ended Dec 31,2009,Three Months Ended Mar 31,2010,Three Months Ended Jun 30,2010? (in thousand)\n\nTotal stock-based compensation"}
{"_id": "q852cab94", "title": "", "text": "What was the total amount of Balance% in the range of 0 and 200000 in 2009 ? (in thousand)\n\ntotal amount, Balance%"}
{"_id": "q83f02d8c", "title": "", "text": "What is the column number of the section towards which the Expenses on Support services is greater than 600 million?\n\nExpenses on Support Services"}
{"_id": "q83470c66", "title": "", "text": "What's the difference of Net flows between 2009 and 2008? (in billion)\n\nNet flows"}
{"_id": "q84b68568", "title": "", "text": "Which Deposits of Average volume has the second largest number in 2015?\n\nDeposits, Average volume"}
{"_id": "q81284e90", "title": "", "text": "How long does Net interest revenue (including dividends) keep growing?\n\nNet Interest Revenue, dividends"}
{"_id": "q81ecc3ec", "title": "", "text": "by how much did net rental expense increase from 2006 to 2008?\n\nnet rental expense"}
{"_id": "q831eac4e", "title": "", "text": "What is the ratio of Other borrowed funds in Table 2 to the Preferred stock in Table 0 in 2016?\n\nOther borrowed funds, Preferred stock"}
{"_id": "q822677ea", "title": "", "text": "In which section the sum of Net sales has the highest value?\n\nNet sales"}
{"_id": "q853f6702", "title": "", "text": "what is the roi of an investment in fidelity national information services from 2007 to 2008?\n\nROI, investment, Fidelity National Information Services"}
{"_id": "q84bbd8c4", "title": "", "text": "What's the growth rate of Total revenues in 2011？ (in million)\n\ngrowth rate, total revenues"}
{"_id": "q81be64ac", "title": "", "text": "In the year with lowest amount of Catastrophes for Prior Years, what's the increasing rate of Attritional for Total Incurred?\n\nCatastrophes, Attritional, Total Incurred"}
{"_id": "q85c627c4", "title": "", "text": "As As the chart 3 shows,between Financial Services Businesses and Closed Block Business,what is the lowest Amount for Equity securities for Year Ended December 31, 2006? (in million)\n\nEquity securities, Financial Services Businesses, Closed Block Business"}
{"_id": "q856c87b4", "title": "", "text": "what was the ratio of the increase net sales to the increased volume of sales for the f-35 production contracts in 2015\\\\n\\\\n\n\nincrease net sales, volume of sales, F-35 production contracts"}
{"_id": "q83d25d02", "title": "", "text": "what was the change in defined contribution plans expenses for the u.s . between 2016 and 2017 in millions?\n\ndefined contribution plans expenses, U.S."}
{"_id": "q83d5e170", "title": "", "text": "How many years does Notebooks/Mobile Devices stay higher than Netcomm Products?\n\nNotebooks/Mobile Devices, Netcomm Products"}
{"_id": "q838a16dc", "title": "", "text": "what is the percentage change in the balance of inventories from 2012 to 2013?\n\npercentage change, balance, inventories"}
{"_id": "q84735fe0", "title": "", "text": "What is the percentage of Residential/Consumer in relation to the total in 2009?\n\nResidential/Consumer, total"}
{"_id": "q82c60594", "title": "", "text": "If Average Balances in terms of Interest-bearing deposits develops with the same growth rate in 2017 Ended December 31, what will it reach in 2018 Ended December 31? (in million)\n\nAverage Balances, Interest-bearing deposits, growth rate"}
{"_id": "q84761ffa", "title": "", "text": "What's the 20 % of total equity securities for Level 1 of U.S. defined benefit pension plans in 2011? (in million)\n\ntotal equity securities, Level 1, U.S. defined benefit pension plans"}
{"_id": "q818d973c", "title": "", "text": "What is the growing rate of Balance on December 31 in the year where Foreign exchange translation is the most?\n\ngrowing rate, Balance, Foreign exchange translation"}
{"_id": "q84d1064a", "title": "", "text": "What is the ratio for unallocated items to the Other for selling, general and administrative expenses. in 2016?\n\nunallocated items, selling, general and administrative expenses"}
{"_id": "q81cd657e", "title": "", "text": "In the year with lowest amount of Total writedowns in terms of Fixed Maturity Securities, what's the growth rate of Proceeds in terms of Fixed Maturity Securities?\n\nTotal writedowns, Fixed Maturity Securities, Proceeds, growth rate"}
{"_id": "q85c2451e", "title": "", "text": "What is the sum of the Long-term debt (a) in the years where Operating leases (b) is positive? (in million)\n\nLong-term debt, Operating leases"}
{"_id": "q855e70f2", "title": "", "text": "What is the average growth rate of Other cost of management of Cost of operations between 2008 and 2009 for Year Ended December 31,?\n\naverage growth rate, Other cost of management, Cost of operations"}
{"_id": "q842a732a", "title": "", "text": "what was the value , in millions of dollars , of net revenues in 2007?\n\nnet revenues"}
{"_id": "q81486b08", "title": "", "text": "What is the sum of Net interest revenue, Non-interest revenue and Revenues, net of interest expense in 2009? (in million)\n\nNet interest revenue, Non-interest revenue, Revenues, net of interest expense"}
{"_id": "q8193eb00", "title": "", "text": "what is the roi of an investment in s&p500 index from 2011 to 2012?\n\nROI, investment, S&P 500 Index"}
{"_id": "q82aee3be", "title": "", "text": "What's the total amount of the Losses on reacquired debt in the years where Contract valuation adjustments(d) is greater than 1? (in thousand)\n\nLosses on reacquired debt, Contract valuation adjustments"}
{"_id": "q82945418", "title": "", "text": "Which year is Commercial in Gross Charge-offs the least?\n\nCommercial, Gross Charge-offs"}
{"_id": "q83f4f3a8", "title": "", "text": "What's the increasing rate of Cost of sales in 2009?\n\nCost of sales"}
{"_id": "q848826d2", "title": "", "text": "In the year with largest amount of Net credit losses, what's the amount of Revenues, net of interest expense and Total operating expenses? (in million)\n\nNet credit losses, Revenues, interest expense, Total operating expenses"}
{"_id": "q8259f1ba", "title": "", "text": "As As the chart 0 shows,the value of the Asset- backed securities at December 31,which year ranks first?\n\nAsset-backed securities"}
{"_id": "q828ef9be", "title": "", "text": "The total amount of which section ranks first in Fair Value?\n\nFair Value, total amount, section"}
{"_id": "q83f6593c", "title": "", "text": "What will Inventories be like in 2015 if it develops with the same increasing rate as current? (in million)\n\nInventories"}
{"_id": "q849ed562", "title": "", "text": "In which section is Net interest income smaller than Total revenue, net of interest expense in 2016 ??\n\nNet interest income, Total revenue, net of interest expense"}
{"_id": "q830527c4", "title": "", "text": "What is the total amount of Southern California of As of December 31, 2010 Apartment Units, Tierra Vista of RentableSquareFootage, and Alpine Country of RentableSquareFootage ?\n\nSouthern California, Tierra Vista, Rentable Square Footage, Alpine Country"}
{"_id": "q854ab756", "title": "", "text": "What is the proportion of Distribution expenses to the total expenses in 2011?\n\nDistribution expenses, total expenses"}
{"_id": "q84e8db44", "title": "", "text": "What is the ratio of ACC-4(5) of Actual Capital in Table 0 to the Short-Term Debt of Adjusted in Table 2 in 2010?\n\nActual Capital, Short-Term Debt, Adjusted"}
{"_id": "q82e1dfc6", "title": "", "text": "What's the total value of all Net income (loss) that are in the range of 1 and 1100000 in 2015 for As previously reported?\n\nNet income, total value, As previously reported"}
{"_id": "q84816a72", "title": "", "text": "In the section with lowest amount of Pan AmFairfax, VA 22031 for Amount, what's the increasing rate of Shoppers’WorldCharlottesville, VA 22091-12 for Amount?\n\nPan Am, Shoppers’ World, Amount, increasing rate"}
{"_id": "q828ca970", "title": "", "text": "what was the change in fair value of retained interests in billions as of december 2018 and december 2017?\n\nfair value, retained interests"}
{"_id": "q8592e77e", "title": "", "text": "Which year is Capital leases of Carrying amount the highest?\n\nCapital leases, Carrying amount"}
{"_id": "q857c0cfc", "title": "", "text": "What's the current increasing rate of U.S. high-grade?\n\nU.S. high-grade, increasing rate"}
{"_id": "q8194e6b8", "title": "", "text": "what is the percentage increase from 2008 customer satisfaction index to the 2010 customer satisfaction index?\n\npercentage increase, customer satisfaction index"}
{"_id": "q828faf8a", "title": "", "text": "What is the sum of Impaired loans with an associated allowance in 2016? (in million)\n\nImpaired loans, allowance"}
{"_id": "q82c8673a", "title": "", "text": "What's the sum of Active in the range of 100000 and 500000 in 2015? (in million)\n\nActive"}
{"_id": "q843194de", "title": "", "text": "what was the percentage change in the reinsurance accounts from 2009 to 2010\n\nreinsurance accounts"}
{"_id": "q83479d2a", "title": "", "text": "What is the average amount of Earnings from operations of 2015, and Pension and other postretirement cash requirements of After 5years ?\n\nEarnings from operations, Pension, postretirement cash requirements"}
{"_id": "q826436a2", "title": "", "text": "What will Pass-through securities be like in 2009 if it develops with the same increasing rate as current? (in million)\n\nPass-through securities, increasing rate"}
{"_id": "q85801d10", "title": "", "text": "What's the total amount of the Total Revenues in the years where Other Expense is greater than 30000? (in thousand)\n\nTotal Revenues, Other Expense"}
{"_id": "q839cb2d8", "title": "", "text": "what is the growth rate in net revenue in 2008 compare to 2007?\n\ngrowth rate, net revenue"}
{"_id": "q84c90ae4", "title": "", "text": "What is the average value of CardServices – reported for Loan losses in 2009, 2008, and 2007? (in million)\n\nCardServices, loan losses"}
{"_id": "q81c0906a", "title": "", "text": "What was the sum of U.S. without those U.S. smaller than 15 in 2018 for Pension Benefits? (in million)\n\nPension Benefits, U.S."}
{"_id": "q82dd3fa2", "title": "", "text": "When does Net revenues in December 31 reach the largest value?\n\nNet revenues"}
{"_id": "q836a7304", "title": "", "text": "What's the sum of all March 31 of Three months ended that are greater than 6000 in 2005? (in million)\n\nsum, March 31, three months ended, greater than 6000"}
{"_id": "q83c5297a", "title": "", "text": "In the year with largest amount of Operating income in table 2, what's the sum of Interest income in table 2? (in thousand)\n\nOperating income, Interest income"}
{"_id": "q83cbc938", "title": "", "text": "What's the sum of Interest on debt of After 5years, Fair value of plan assets of 2016, and Total assets of December 31, 2012 Total ?\n\nInterest on debt, Fair value of plan assets, Total assets"}
{"_id": "q84aedba6", "title": "", "text": "What is the average amount of Interest expense, net of Year Ended December 31, 2013, and Office equipment of December 31, 2015 ?\n\nInterest expense, Office equipment"}
{"_id": "q8528daa0", "title": "", "text": "how much money can the company deduct on the income tax in the future after this acquisition?\n\nincome tax, acquisition"}
{"_id": "q85aacf9c", "title": "", "text": "what is the total amount of principle payment paid from 2008 to 2011?\n\ntotal amount, principal payment"}
{"_id": "q8246be4c", "title": "", "text": "What is the sum of Purchase obligations of December 31, 2009 Due after 5 Years, Commercial real estate of December 31 2009 Amount, and Small business commercial – domestic of December 31 2009 Amount ?\n\npurchase obligations, commercial real estate, small business commercial"}
{"_id": "q81906eda", "title": "", "text": "what is the percentage change in the balance of asset allocation from 2016 to 2017?\n\npercentage change, balance, asset allocation"}
{"_id": "q81dec7ec", "title": "", "text": "by how much did the allowance for doubtful accounts increase from 2005 to 2006?\n\nallowance for doubtful accounts"}
{"_id": "q83427390", "title": "", "text": "Which year the CECONY full service customers is the lowest?\n\nCECONY, full service customers, lowest"}
{"_id": "q84a6d6b8", "title": "", "text": "What was the total amount of the Noninterest expense in the years where Net occupancy is greater than 18000? (in thousand)\n\nNoninterest expense, Net occupancy"}
{"_id": "q851c1f0e", "title": "", "text": "What's the average of the Property and equipment, net in the years where Basic weighted average common shares outstanding greater than 395000 ? (in thousand)\n\nProperty and equipment, Basic weighted average common shares outstanding"}
{"_id": "q84c73f70", "title": "", "text": "Which year the Management and financial advice fees is the most?\n\nManagement and financial advice fees"}
{"_id": "q82adc86c", "title": "", "text": "What is the growing rate of Fixed maturities in Carrying Value in table 0 in the year with the most Equity securities in Carrying Value in table 0?\n\ngrowing rate, Fixed Maturities, Carrying Value, Equity Securities"}
{"_id": "q8308c00a", "title": "", "text": "what were the remaining mondovi net assets acquired following the sale of certain excess assets from the deal , in thousands?\n\nMondovi, net assets, excess assets, deal"}
{"_id": "q85adb040", "title": "", "text": "What's the increasing rate of Fixed income of Active in 2016?\n\nincreasing rate, Fixed Income, Active"}
{"_id": "q84c64732", "title": "", "text": "What's the sum of all Qualifying Accounting Hedges-2 that are positive in 2010 for Gross Derivative Assets? (in billion)\n\nQualifying Accounting Hedges-2, Gross Derivative Assets"}
{"_id": "q84d37542", "title": "", "text": "What's the sum of all Additional Paid-in Capita that are positive in 2007? (in thousand)\n\nAdditional Paid-in Capital"}
{"_id": "q8199c7aa", "title": "", "text": "What is the total amount of Net sales of 2012, Commercial paper of 2010 Fair Value, and U.S. government and agency securities of 2011 Fair Value ?\n\nNet sales, Commercial paper, Fair Value, U.S. government and agency securities"}
{"_id": "q814cc00e", "title": "", "text": "In which year is Securities loaned greater than 14000?\n\nSecurities loaned"}
{"_id": "q8455ea96", "title": "", "text": "Which year is Standardized Approach the most? (in million)\n\nStandardized Approach"}
{"_id": "q81243044", "title": "", "text": "What was the average of the Total operating revenues in the year where Other investment income/(losses) is positive? (in million)\n\nTotal operating revenues, Other investment income"}
{"_id": "q8160f1dc", "title": "", "text": "Does the average value of As of January 1 in Number of Awards greater than that in Weighted Average Grant Date Fair Value?\n\naverage value, Number of Awards, Weighted Average Grant Date Fair Value"}
{"_id": "q848282b8", "title": "", "text": "What is the average increasing rate of Money market funds between 2012 and 2013?\n\nMoney market funds, average increasing rate"}
{"_id": "q84ab0bf2", "title": "", "text": "What is the Fair Value of other debt securities in 2011?\n\nFair Value, other debt securities"}
{"_id": "q8245c302", "title": "", "text": "What is the total value of Operating revenues, Purchased power , Fuel and Other operations and maintenance for Electric ? (in million)\n\nOperating revenues, Purchased power, Fuel, Other operations and maintenance"}
{"_id": "q822237e8", "title": "", "text": "what was the percentage change in weighted average shares outstanding for diluted net earnings per share from 2006 to 2007?\n\npercentage change, weighted average shares outstanding, diluted net earnings per share"}
{"_id": "q819227de", "title": "", "text": "what was the percent change in operating leases between 2011/12 and 2013/4?\n\npercent change, operating leases"}
{"_id": "q83076002", "title": "", "text": "Which year is Production expenses, including related taxes greater than 100 ?\n\nProduction expenses, related taxes"}
{"_id": "q8489f7dc", "title": "", "text": "In what sections is Corporate and other bonds greater than 100?\n\nCorporate and other bonds"}
{"_id": "q81cc588c", "title": "", "text": "from 2014 to 2016 , what was the total amount of money they can deduct from their future income tax due to amortization?\n\ntotal amount, money, future income tax, amortization"}
{"_id": "q842c0636", "title": "", "text": "In which section the sum of Three months or less has the highest value?\n\nthree months or less, highest value"}
{"_id": "q824af32c", "title": "", "text": "What's the total amount of the Financial standby letters of credit in the years where Benefit plans-3 is less than -6,250 (in million)\n\nFinancial standby letters of credit, Benefit plans"}
{"_id": "q83ca3ed8", "title": "", "text": "Does the average value of Total fixed rate debt in 2010 greater than that in 2011?\n\nTotal fixed rate debt"}
{"_id": "q825d30aa", "title": "", "text": "As As the chart 3 shows,which year is the value of Total revenues for Regulated Natural Gas the highest?\n\nTotal revenues, Regulated Natural Gas"}
{"_id": "q82080364", "title": "", "text": "how much of total minimum lease payments ( in millions ) are not due to assets under construction?\n\ntotal minimum lease payments, assets under construction"}
{"_id": "q82234fde", "title": "", "text": "What's the current increasing rate of Interest cost on benefit obligation in U.S. pension plans?\n\nInterest cost, benefit obligation, U.S. pension plans"}
{"_id": "q832afed6", "title": "", "text": "Which year is Group Retirement Products* the most? (in year)\n\nGroup Retirement Products"}
{"_id": "q8569a382", "title": "", "text": "In the year with the most Mutual funds, what is the growth rate of Equity products?\n\nMutual Funds, growth rate, Equity Products"}
{"_id": "q81d1e3b0", "title": "", "text": "As As the chart 3 shows,what's the growth rate of the value of Total revenues for Regulated Natural Gas in 2008?\n\ngrowth rate, Total revenues, Regulated Natural Gas"}
{"_id": "q854ea032", "title": "", "text": "what was the total amount lost from the bond authorization to the withdrawn?\n\ntotal amount lost, bond authorization, withdrawn"}
{"_id": "q818bcaa6", "title": "", "text": "What will Investment securities be like in 2013 if it develops with the same increasing rate as current? (in million)\n\nInvestment securities"}
{"_id": "q8491f3ba", "title": "", "text": "if hr solutions generated 25% ( 25 % ) of total revenues , what are the total revenue for aon in 2010 , ( in millions ) ?\n\nHR Solutions, total revenues, Aon"}
{"_id": "q81b04e76", "title": "", "text": "how much did the company 2019s valuation allowance decrease from 2011 to 2012?\n\nvaluation allowance"}
{"_id": "q85beddf2", "title": "", "text": "What's the sum of all Significant Other Observable Inputs (Level 2) that are positive in 2011? (in million)\n\nSignificant Other Observable Inputs, Level 2"}
{"_id": "q818a37b8", "title": "", "text": "What's the difference of Residential/Religious of kWhs Delivered between 2005 and 2004? (in million)\n\nResidential, Religious, kWhs Delivered"}
{"_id": "q837dfed8", "title": "", "text": "What is the sum of the Consumers in the section where Consumers is greater than 1 (in million)\n\nConsumers"}
{"_id": "q836e80f2", "title": "", "text": "What's the average of the Commissions for Year Ended December 31, in the years where Goodwill and other intangible assets, net of deferred tax liabilities is positive?\n\naverage, Commissions, Goodwill, intangible assets"}
{"_id": "q834c4d84", "title": "", "text": "If Total revenues develops with the same growth rate in2011, what will it reach in 2012? (in million)\n\nTotal revenues, growth rate"}
{"_id": "q80f0a76a", "title": "", "text": "Does the average value of Power purchase agreements in Entergy Arkansas greater than that in Entergy Louisiana?\n\nPower purchase agreements, Entergy Arkansas, Entergy Louisiana"}
{"_id": "q85a7cc98", "title": "", "text": "What's the sum of all elements that are positive for Auto & Home? (in million)\n\nAuto & Home, sum, positive elements"}
{"_id": "q81d4df20", "title": "", "text": "what percentage of the company's receivable balances in puerto rico as of december 31 , 2017 was past due?\n\nreceivable balances, Puerto Rico, past due"}
{"_id": "q83364962", "title": "", "text": "In what year is Total revenue greater than 13000000?\n\nTotal revenue"}
{"_id": "q857b4efc", "title": "", "text": "What is the percentage of Con Edison's Current Fair value of derivative assets of Gross Amounts of Recognized Assets/ (Liabilities) in relation to the total in 2014?\n\nCon Edison, Current Fair Value, Derivative Assets, Gross Amounts"}
{"_id": "q833ef6de", "title": "", "text": "what's the total amount of U.S. credit card Loans and leases charged off of 2016, and Cash proceeds from new securitizations of Residential Mortgage Agency 2014 ?\n\nU.S. credit card loans, leases charged off, cash proceeds, Residential Mortgage Agency"}
{"_id": "q81a22a62", "title": "", "text": "What's the increasing rate of Goodwill in 2016? (in million)\n\nGoodwill, increasing rate"}
{"_id": "q82d8ef42", "title": "", "text": "by how much did the balance increase from the beginning of 2017 to the end?\n\nbalance increase"}
{"_id": "q81f4001c", "title": "", "text": "What's the sum of allCash and cash equivalents and Unsettled fund receivables that are positive in 2011? (in million)\n\nCash and cash equivalents, Unsettled fund receivables"}
{"_id": "q826322e4", "title": "", "text": "what was the total intrinsic value of options exercised during 2007 , 2006 and 2005 in millions?\n\ntotal intrinsic value, options exercised"}
{"_id": "q83b8b2ee", "title": "", "text": "How many Commitment Type continues to decrease each year from 2015 to 2017?\n\nCommitment Type"}
{"_id": "q811391f8", "title": "", "text": "what was the change in advertising costs from 2001 to 2002?\n\nadvertising costs"}
{"_id": "q83b59da2", "title": "", "text": "What is the sum of the Total Loans in the sections where Commercial Loans is positive? (in thousand)\n\nTotal Loans, Commercial Loans"}
{"_id": "q813b8c26", "title": "", "text": "What's the sum of the Unit redemptions in the years where Mortgages Payable for Carrying Amounts is positive?\n\nUnit redemptions, Mortgages Payable, Carrying Amounts"}
{"_id": "q812cf9ae", "title": "", "text": "What is the growing rate of BENEFIT OBLIGATION AT END OF YEAR for Con Edison in the year with the least Benefit obligation at beginning of year for Con Edison?\n\ngrowing rate, Benefit Obligation, Con Edison"}
{"_id": "q846236fc", "title": "", "text": "what's the total amount of Bermuda of At December 31, 2017 Case Reserves, Insurance of At December 31, 2016 Case Reserves, and International of At December 31, 2016 Total Reserves ?\n\nBermuda, Case Reserves, Insurance, Total Reserves"}
{"_id": "q85a99302", "title": "", "text": "What is the sum of Bermuda of IBNR Reserves in 2017 and Insurance of Case Reserves in 2016? (in million)\n\nBermuda, IBNR Reserves, Insurance, Case Reserves"}
{"_id": "q82b3823e", "title": "", "text": "What was the average value of the International Funds in the years where Federal Money Market Funds is positive for Total? (in million)\n\naverage value, International Funds, Federal Money Market Funds, Total"}
{"_id": "q84a29b34", "title": "", "text": "What's the total amount of Defined benefit plans excluding those negative ones in 2015?\n\nDefined benefit plans"}
{"_id": "q8195ccf4", "title": "", "text": "When is Benefit obligation at beginning of year for Con Edison the largest?\n\nBenefit obligation, Con Edison"}
{"_id": "q84ca661e", "title": "", "text": "Which year the Net income of Restated is the highest?\n\nNet income, Restated"}
{"_id": "q83c2a93e", "title": "", "text": "in 2006 what was the total amount authorized by the board of directors authorized for the repurchase of shares in billions\n\ntotal amount, authorized, board of directors, repurchase of shares"}
{"_id": "q81e4f9be", "title": "", "text": "In the year with largest amount of Interest rate what's the sum of Equity and Credit derivatives for Notional amounts? (in billion)\n\nInterest rate, Equity, Credit derivatives, Notional amounts"}
{"_id": "q8400a284", "title": "", "text": "In the year with the most Interest cost in Table 1, what is the growth rate of Environmental in Table 0?\n\nInterest cost, growth rate, Environmental"}
{"_id": "q84c305fe", "title": "", "text": "Which Year Ended December 31 does the Amount of Commercial mortgage and other loans rank first?\n\nCommercial mortgage, loans"}
{"_id": "q85752c8e", "title": "", "text": "what's the total amount of Cost of goods sold of Year Ended December 31, 2016, Inventories of At December 31, 2013, and Leasehold and tenant improvements of December 31, 2016 ?\n\nCost of Goods Sold, Inventories, Leasehold Improvements, Tenant Improvements"}
{"_id": "q83228472", "title": "", "text": "Which year is Proceeds the highest in Fixed Maturity Securities?\n\nProceeds, Fixed Maturity Securities"}
{"_id": "q845279c4", "title": "", "text": "what is the highest total amount of JW Marriott?\n\nJW Marriott, total amount"}
{"_id": "q85874db0", "title": "", "text": "What's the growth rate of the amount of Equity securities in 2009 Ended December 31?\n\ngrowth rate, Equity securities"}
{"_id": "q81a371f6", "title": "", "text": "What's the average of the Attritional for Current Year in the years where International is positive? (in million)\n\naverage, Attritional, Current Year, International"}
{"_id": "q83fb1e4a", "title": "", "text": "What is the average value of Gain (loss) on assets related to executive deferred compensation plan in 2017,2016 and 2015 for Year Ended October 31,? (in million)\n\nGain (loss), assets, executive deferred compensation plan"}
{"_id": "q814f56d4", "title": "", "text": "What's the increasing rate of Investment Bank for Total in 2009?\n\nInvestment Bank, Total"}
{"_id": "q8499ad76", "title": "", "text": "What is the sum of elements in 2011 ? (in million)\n\nsum, elements"}
{"_id": "q81f2e43e", "title": "", "text": "for december 31 , 2009 , what was the total value of segregated collateral for the benefit of brokerage customers in millions?\n\nsegregated collateral, brokerage customers"}
{"_id": "q8566cf36", "title": "", "text": "what's the total amount of Cash provided by operating activities of 2013, and Reinsurance assets of 2017 As Reported ?\n\nCash provided by operating activities, Reinsurance assets"}
{"_id": "q851cc3be", "title": "", "text": "what is the net change in the other retained interests not reflected in the table during 2018 , in millions?\n\nnet change, other retained interests"}
{"_id": "q83a62494", "title": "", "text": "What's the total amount of the Net income in the years where Land is greater than 0? (in thousand)\n\nNet income, Land"}
{"_id": "q81b53972", "title": "", "text": "What was the average value of Employee Compensation and Benefits, Communications and Information Processing, Occupancy and Equipment in 2006?\n\nEmployee Compensation and Benefits, Communications and Information Processing, Occupancy and Equipment"}
{"_id": "q83daa26e", "title": "", "text": "What's the sum of all elements that are greater than 5000 in Total contractual obligations? (in million)\n\nTotal contractual obligations"}
{"_id": "q831886de", "title": "", "text": "What is the sum of the Finance — Finance Companies in the sections where Finance — Finance Companies is positive? (in million)\n\nFinance Companies"}
{"_id": "q833247b8", "title": "", "text": "What is the average amount of Employee separations of Other, and Operating activities of Year Ended December 31, 2007 ?\n\naverage amount, Employee separations, Operating activities"}
{"_id": "q85d3a8c2", "title": "", "text": "what is the growth rate in the consolidated revenues from 2011 to 2012?\n\ngrowth rate, consolidated revenues"}
{"_id": "q857a4322", "title": "", "text": "what was the net change in airliner count during 2016?\n\nnet change, airliner count"}
{"_id": "q83a43364", "title": "", "text": "What is the average growth rate of Attritional for current year between 2015 and 2016? (in %)\n\naverage growth rate, Attritional"}
{"_id": "q83ab3cf4", "title": "", "text": "What is the total value of Mutual funds, Insurance and annuity products, Equity products and Fixed income products in 2018? (in thousand)\n\nMutual funds, Insurance, Annuity products, Equity products, Fixed income products"}
{"_id": "q8538e544", "title": "", "text": "what was the difference in millions in liabilities related to asset retirement obligations between 2003 and 2003?\n\nliabilities, asset retirement obligations"}
{"_id": "q84bf69a8", "title": "", "text": "What's the 50% of the sum of all Total expenses? (in million)\n\nTotal expenses"}
{"_id": "q829ce3f8", "title": "", "text": "Does Net actuarial loss keeps increasing each year between 2014 and 2016?\n\nNet actuarial loss"}
{"_id": "q843299d8", "title": "", "text": "What's the current growth rate of Projected benefit obligation at beginning of year of Con Edison?\n\ngrowth rate, Projected Benefit Obligation, Con Edison"}
{"_id": "q8534d314", "title": "", "text": "what was total rent charged to operating expense in millions for 2013 , 2012 and 2011?\n\ntotal rent, operating expense"}
{"_id": "q85a5bb42", "title": "", "text": "what's the total amount of Group retirement products of Net Investment Income, Cash at end of year of 2011, and Group retirement products 2005 of Total Revenues ?\n\nGroup retirement products, Net Investment Income, Total Revenues"}
{"_id": "q852d98f6", "title": "", "text": "What's the current increasing rate of principal transactions? (in %)\n\nprincipal transactions, increasing rate"}
{"_id": "q82a64de4", "title": "", "text": "what percent of the net change in revenue between 2006 and 2007 was due to transmission revenue?\n\nnet change in revenue, transmission revenue"}
{"_id": "q812183d0", "title": "", "text": "What is the sum of the amount of Equity securities in the range of 50 million and 100 million? (in million)\n\nEquity securities"}
{"_id": "q825563f2", "title": "", "text": "What's the growth rate of Payments due by period 2019 for long-term debt obligations?\n\ngrowth rate, Payments, long-term debt obligations"}
{"_id": "q816a4a7a", "title": "", "text": "what is the highest total amount of Aircraft on Firm Order?\n\nAircraft, Firm Order"}
{"_id": "q821b69a4", "title": "", "text": "In what sections is Investment Bank greater than 1000?\n\nInvestment Bank"}
{"_id": "q837bea62", "title": "", "text": "What's the growth rate of Goodwill and other intangible assets, net in 2017? (in %)\n\nGoodwill, intangible assets, growth rate"}
{"_id": "q83b7e33c", "title": "", "text": "In the year with the most Expected volatility of Conversion Feature in Table 0, what is the growth rate of Net credit losses in Table 2?\n\nExpected volatility, Conversion Feature, growth rate, Net credit losses"}
{"_id": "q83583c0c", "title": "", "text": "What is the growing rate of total asset-6 in the year with the most gross profit? (in %)\n\ntotal asset-6, gross profit"}
{"_id": "q814d91b4", "title": "", "text": "what is the growth rate in operating income of hr solutions from 2009 to 2010?\n\ngrowth rate, operating income, HR Solutions"}
{"_id": "q8183d97c", "title": "", "text": "What's the sum of Repurchases from securitization trusts of Residential Mortgage Agency 2015, and U.S. credit card Loans and leases charged off of 2013 ?\n\nRepurchases, securitization trusts, Residential Mortgage Agency, U.S. credit card Loans and leases charged off"}
{"_id": "q81c45934", "title": "", "text": "the specific reserves in the alll as of december 31 , 2012 were what percent of the tdr portfolio?\n\nspecific reserves, TDR portfolio"}
{"_id": "q8364ba86", "title": "", "text": "what was the percentage change in fuel surcharge program freight revenue from 2012 to 2013?\n\nfuel surcharge program, freight revenue"}
{"_id": "q83d6bbae", "title": "", "text": "what is the percentual growth of the global products' atoi concerning the total atoi for all segments during the years 2014-2015?\n\npercentual growth, global products, total atoi, segments"}
{"_id": "q824d9802", "title": "", "text": "by what percentage did total residential mortgages increase from 2011 to 2012?\n\ntotal residential mortgages"}
{"_id": "q85039a74", "title": "", "text": "At December 31, 2015,what is the Gross Unrealized Gains for Technology Corporate securities ? (in million)\n\nGross Unrealized Gains, Technology Corporate securities"}
{"_id": "q85a46076", "title": "", "text": "What was the total amount of Nonaccrual Loans in 2010 for As of September 30,? (in thousand)\n\nNonaccrual Loans, total amount"}
{"_id": "q84978ff0", "title": "", "text": "Which year is Retirement of treasury stock for Treasury Stock of Common Stock the least?\n\nRetirement of treasury stock, Treasury Stock, Common Stock"}
